[{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=5098624002293760","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"2","title":"What is the default port for mysql?","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"3306"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"3306"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=6004339189481472","download_status":"DOWNLOAD_DONE","votes":"1","answersCount":"4","title":"What is inside a packet?","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"A packet is one unit of binary data capable of being routed through a computer network. To improve communication performance and reliability, each message sent between two network devices is often subdivided into packets by the underlying hardware and software."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-1","title":"which packet you are talking about ,any way you can use wireshark to get the exact content of a packet ."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-1","title":"A gift. Usually!"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-1","title":"A packet can contains many many datas. Either on the physical plane or the digital volume (or any disruptive synergistic advances made which we are unaware of). It could contain Quantum data like Schrodinger's pussy or Dick Feynman's squiggly.  IN ANY CASE, TO DETERMINE WHAT IS INSIDED THE PACKET, CHECK THE LABEL! HA HA HA HA."}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=5163800265228288","download_status":"DOWNLOAD_DONE","votes":"1","answersCount":"2","title":"Difference between Active and Passive FTP?","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"You can find your answer here:  slacksite.com/other/ftp.html"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"In active mode, the client sends the server the IP address and port number on which the client will listen so the server has to initiate the data connection. Here port 21 is control and port 20 is data on the server side. In Passive mode, the client sends a PASV command to the server and receives an IP address and port number in return for data transfer. Here port 21 is control and a random port >1024 is used for data on the server side. This is useful when the client is behind firewall and not accepting incoming connections."}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=291740","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"8","title":"A client is deploying a web service from a server. The web service is slow. What would you do to find the root cause of the slowness?","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"client side 1) caching server side 1) mirroring  use content delivery networks (akamai etc.)"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"increase the RAM size :)"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"increase the RAM size :)"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"There can be so many things. from bandwidth to high server load to incorrect algorithm"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Congestion in network,traffic overload or there might be too many objects in the web page to be retrieved etc.."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"write a test client which accesses the web service. Profile the complete system flow when the web service is accessed to find the bottleneck [some possibilities: high network latency, poor cache hit ratio, db access latency (if applies), too many context switches- run different servers(app/web/db) on different machines]"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=23890665","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"3","title":"WRP to determine if a IP address belongs to a network.  The interviewer expected details about subnet masking","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Logic is bit-wise and operation between networkaddress and IPaddress gives networkaddress.  1. Convert decimal dotted quad string to long integer 2. Convert a network address to a long integer 3. verify ip & net == net  Python code:"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"A network mask helps you to determine which portion determines the network id and which portion determines the node id.  class A-255.0.0.0 class B-255.255.0.0 class C-255.255.255.0  Subnetting allows you to have multiple networks from among the class of networks which are A,B,C instead of having only one network from among the classes A,B,C. Here for class C the subnet mask is 255.255.255.224 here as the first 3 bits are set you can have 8 subnets and 32 host addresses. For class B you can have more subnets and more host addresses as 255.255.248.0 allows you to have 32 subnets and 2^11 host addresses. It is also denoted as /27 as 27 bits are set in the network."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"(Boolean) AND each address against the subnet mask then compare (SUB-tract).  If the two are equal then the address is within the network.  AND in this case *masks off* the same number of lower bits from the network address and the address being tested. Thus the name \"subnet *MASK*.  (In assembly language SUB-traction and comparison are effectively the same operation --- if different op-codes are present for both on a given processor it's likely that they only differ in which flags are set by the operation.  A \"zero\" result from the subtraction only occurs if the two operand were exactly equal.  Otherwise the result is either a positive or negative number; the precise representation of that number in the processor will depend on the architecture)."}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=311714","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"3","title":"What happens when you type http://xyz.com  and questions related to that like http requests ,ports , sockets etc","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-3","title":"Oops! This link appears to be broken"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=4882325288517632","download_status":"DOWNLOAD_DONE","votes":"1","answersCount":"2","title":"How does traceroute work?","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"2","title":"we start sending packet to the destination ,TTL starting with 1 ,so at first router TTL will be zero and packet will be dropped .But the router will send you an ICMP packet back which will tell you about the first router on the way.Like wise we will do this upto destination network.One more thing we will use a unused port no. ,which will be discarded at the destination and an ICMP packet willl be sent back.By doing this we can trace the route.  but there is no gurantee that it will fine exact route every time,because there are many paths to reach a destination on the internet.However probability of this is very low."}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=5764498551996416","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"1","title":"Difference between A record and CName?","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"The A record maps a name to one or more IP addresses, when the IP are known and stable. The CNAME record maps a name to another name. It should only be used when there are no other records on that name."}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=6509608940077056","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"1","title":"Name some DNS records and their purposes.","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"NS - Name server record A record - Assigning IP address to a  domain/sub-domain MX - record - pointing the mail exchanger record for the domain so all emails are routed to the mx record which usually is a subdomain or domain name with a valid A record. CNAME - canonical name record makes one domain name an alias of another"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=6271593529475072","download_status":"DOWNLOAD_DONE","votes":"1","answersCount":"1","title":"I type www.Amazon.com into the browser and click go, explain in detail what happens?","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"1. Browser will contact DNS (Domain Name Server) to get the IP address. 2. DNS sends back the IP address to the Browser. 3. Browser will establish a TCP connection with the web server at port 80. 4. Browser will retrieve HTML code. 5. Browser will display the page based on HTML content.."}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=5234098939363328","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"2","title":"What steps are involved in serving a web page to a client?","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"serving a web page to a client can mean 2 diffrt things... the first is that we knoe the address of the page that we are searching for...dns will give us the reqd ip adress... arp and rarp will look for that ip address.... and the second and a little complex is searching via a search engine.. a search engine has 3 parts.. the first one is crawler.. it comprise of huge number of computers that crawl through millions of pages on a daily basis.. delete pages that have expired and add the new ones in the index... then comes indexing the web pages that are found by crawler.... this is one with the help of hundreds of factors.. the metric used for measuring importance of a web page is PAGE RANK.. the bettr rank.. the relevant ur page is to that query.. this is indexing.....atlast is serving the desired pages... this is again based on page rank... more relevant pages are displayed first.."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"At application level, it follows below: 1. client send request to container(web container say server). 2. container checks if it is available or can it be generated dynamically (through servlets). 3. container send the response in particular format that client sent in the request header (e.g; displays web page on browser if format is \"html\")"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=320715","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"2","title":"Implement a connection pool","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"java.sun.com/developer/onlineTraining/Programming/JDCBook/Code/JDCConnectionPool.java"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Here is my implementation strategy:  Create a ConnectionPool class. A Properties class can be used as the initial parameter for the constructor of the ConnectionPool class. The properties may include database connection information, pool size, adjusting pool size, pooled connection timeout and lent out connection timeout.  ConnectionPool should be able to maintain a list of Connection object including creating connections, renew connections, adjusting pool size and taking back overtimed connections which have been lent out.   The ConnectionPool class should provide a getConnection() method to lend out a connection to client program and a returnConnection(Connection conn) method for the client program to return the connection. When getConnection() is invoked, an unused database connection object will be marked as used and returned to client program. When there are no available database connection objects in the pool, one strategy is to increase the pool size and return new created connection object. We can also let the client thread wait() on the ConnectionPool object until there is connection object available again. We can also add a tryGetConnection(long millionseconds) method to try to get a connection in a certain time if needed.  For concurrent programming, synchronized can be added to getConnection() method and returnConnection() method. Or we can use a Semaphore inside ConnectionPool to indicate avaliable connection objects.  Create a ConnectionWrapper class which implements java.sql.Connection class.  When the client program invokes getConnection() method, the database connection object will be encapsulated in the ConnectionWrapper class. ConnectionWrapper object also keeps a reference of the ConnectionPool object.  The client program will still get a reference of the java.sql.Connection from getConnection() method. But all methods invoked on the ConnectionWrapper object will be transfered onto the actual database connection object except for the close() method. The close() method of the ConnectionWrapper object will return the database connection to the connection pool without closing it."}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=62655","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"2","title":"Explain how HTTP get/post method works.","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"\"The HTML specifications technically define the difference between \"GET\" and \"POST\" so that former means that form data is to be encoded (by a browser) into a URL while the latter means that the form data is to appear within a message body. But the specifications also give the usage recommendation that the \"GET\" method should be used when the form processing is \"idempotent\", and in those cases only. As a simplification, we might say that \"GET\" is basically for just getting (retrieving) data whereas \"POST\" may involve anything, like storing or updating data, or ordering a product, or sending E-mail.\""},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"http://www.http.header.free.fr/http.html"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=4817149025583104","download_status":"DOWNLOAD_DONE","votes":"1","answersCount":"1","title":"Difference between ping and traceroute?","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"The main difference between the common Ping and Traceroute commands is that Ping is a quick and easy way to tell you if the destination server is online and estimates how long it takes to send ands receive data to the destination. Traceroute tells you the exact route you take to reach the server from your computer (ISP) and how long each hop takes."}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=4901772900433920","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"1","title":"What is exactly in an A record?","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"The record A specifies IP address (IPv4) for given host. A records are used for conversion of domain names to corresponding IP addresses."}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=16991676","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"1","title":"When you enter website what is the communication you see on FIDDLER. The request responses.","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"But its not simple to say only response. You can see everything. attrribute/header may be xml/html, images path and a  lot of things in response. You can also see all the name,value pairs going along with request if URL contains a FORM submit.   A very much useful product for debugging web applications."}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=62826","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"1","title":"Explain how to use servlets and JSP.","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"You don't - you delete them and rewrite them in a well designed web stack."}]}}]