[{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=1938","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"44","title":"Given two log files, each with a billion usernames (each username appended to the log file), find the usernames existing in both documents in the most efficient manner? Use pseudo-code or code. If your code calls pre-existing library functions, create each library function from scratch.","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"even reading the file?"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"This seems like a question from a freddy nightmare. It's asking you to simulate a scanner for a compiler by using regular expressions."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"wont building an index (B+ Tree) be better than sorting?"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"creator,Building a B-tree doesn't change the complexity much. It would still be NlgN kind of thing."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"if each username is even 20 Bytes, the total size of each file will be atleast 20 GB. So, a B+ tree can be constructed for one of the files (the smaller one)  and then we look for entries of the second file on this tree. Probably there is another method, If I find I will post. Gayle, can you comment on my solution."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Some sort of suffix tree should do the trick..If memory is not the problem then hash all the names in the first one and check when reading the second one in O(n) time"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"1) File 1.append(file2) o(n)2) Sort O(nlogn)3) Find the duplicates by a single traversal and comparing the successive elements.2 functions to implement -- Append- SortProblem: If duplicates are in the same file, wrong information will popout."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"So you could sort the smaller of the two files. Since would be a problem with such a huge file, one can do a n way merge sort of the smaller file. Once that is there, do a binary search of each element of the other file in the sorted file. So if the no of elements in the smaller file is n and larger file is m then the running time would be O(mlogn). Any suggestions???"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"for 1 file  read each line,   hash into their abc buckets depending on the start of    the letter of the word. (26 buckets for A to Z     to form something like a 26 by xxx table)  then sort each 26 rows in the hash table and delete dupsfor 2nd file  sort and delete dups  for each line/name, find match in the hashtable.  if matchfind, output to another file name foundmatch"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I think the b+ tree would be a good suggestion if the memory is not a problem. This is because in a normal sorting, it would be nlogn where log is base 2, while using a b+ i could increase the fan outs and make the height smaller depending on the sample set tht i have. like say the larger file can be indexed and each value of the smaller file can be searched. so it would take mlog(base fanouts)n < nlog(base 2)n. Gayle what do you think???any suggestions when your input is large?"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"use hashset to store all the usernames present in one file.than try to insert the usernames present in other file in this hashset one by one ....if the username is inserted than it is unique and returns true and if not than it returns false and so duplicate exist.search time is O(1)......for hashset(i think so...i m not sure)"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"We can build a hashtable for all the alphabets from the larger file. This shud be done for the 26 alphabets. Now from the smaller file, we take each the charecter one by one and xor it with the hash table after a charecter look up. Now we know taht if the value is present in the hash table, then x^x = 0. So if we get a zero, then we can output that charecter. Any comments?"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"This was asked in my RIVERBED interview. I told him the same if memory is not a problem, we could hash al the words which would result in O(1) or memory is limited we could still do hash table but complexity would increase. Its basically a tradeoff on what you have and wanna achieve I felt. But again the interviewer was not exactly amused!"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"we can build a hash table and set all the first names from the first file.xor the hash value of the first names from the second file. Do a lookup on the hashtable and find all the names that have a 0. So these will be the repeated names. But to ensure the uniqueness of the names, now we can pick up all the names which has a zero in the hash table, from file one and do a binary search in file two for it. If it is found, then that is the common name."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Considerations:The file may be too big to fit into RAM.Approach:The problem asks to find intersection; basic set theory. Use 1 Hash Set(array-based preferably). If an intersection occurs, display."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"If memory is an issue, then another approach would be to hash all the usernames from both files into smaller temporary files. Then the program can deal with the smaller files individually to determine if there is a duplicate. To avoid ambiguity (say if there's a duplicate usernames in a single logfile), store the file id to know where a username originially from. I think the biggest bottleneck for this algoritm is the disk access, so it is a good idea to read in huge chucks (say 100MB)."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"1. Dictionary principleFor the smaller file create tries tree.Than for each username from bigger file check the tries tree which will take O(1).If username contain only 26 alphabets characters and not longer than 10 than tree is going to have 26^10 nodes.But for longer usernames and not only alphabets it might be not the best solution.or2. Use hash"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Assumption: Sufficient memoryFirst file needs to be preprocessed - use a hashmap to key values by alphabet. The value is a presorted list of user names.Second file - use the key to get the list and do a binary search thereafter"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"How about using comm utility of unix. comm -1 -2 file1 file2"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Looks like both files have almost the same number of usernames, so any algorithm that depends on finding the smaller file wont be reliable.Here's another thought: go through both files simultaneously, add each entry from both files into hash. If unable to add, the element already exists.Pseudo Code:"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"how about uniq -u to get all unique names in file1 and file2, concatenate the results and then uniq -d"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"do a m-way merge sort of both files independtnly.Repeat the following as long as both files are not completely read:1.Read one buffer from file1, one buffer from file2.2.while the first name in buffer1 is > last name in buffer2    read next buffer from file2 into buffer2.  while the first name in buffer2 is > last name in buffer1    read next buffer from file1 into buffer1.3. if EOF not reached, now we have 2 buffers that have overlapping names. since the buffers are sorted find the common names by just going through the names once (similar to merge sort)"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Depends on restriction on usernames.My idea: If a username is at most 8 characters, say, you can view it as an 8 'digit' number in base 27 (you need one extra character for a 'null' character for those usernames that aren't as long as 8).2 billion ASCII usernames at 8 chars each is ~16GB, doing it all in-memory is a problem. So, you can use radix sort and do 8 passes over the data. Make 27 temp files, one for 'a', one for 'b' ... 'null', and push all usernames with the right character in position 8 into the right file, then do the same thing over all those files for position 7, then position 6, until you've sorted by the first character. Then you'll have all the usernames from both files in sorted order. At that point you can just scan through each file via a stream and look for repeated usernames in sequence.If L is the max length of your usernames, S1 is the # of usernames in first file, S2 is # of usernames in second file, this is O( L(S1 + S2) ), and uses constant space in memory. Since L is a constant, this is linear time. Lots of disk I/O though.You could probably improve the runtime by doing more of the radix-sorting in memory and flushing to disk in blocks, but that's what buffered IO is for :D"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"BTW you can see similar problems to this in Jon Bentley's Programming Pearls 2ed., chapter 2 (I think)."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Build a trie of the first file using all the usernames. then pick up each name from the second file and check if it exists in the trie."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"first of all, since the log file has a billion usernames, then, we should assume there is no enough memory to hold all the usenames. So, we should use external sort to sort both files at first. Then, we can merge these two sorted file.  If memory is not a problem, then, just use unix command like 'cat f1 f2 | sort | uniq -d > f3'."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"fools"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Can we use trie?"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"We can use XOR  to compare duplicate. Take XOR of all usernames in file1 and then XOR with each username of File2 . If result is 0 then user name exist in both the files."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-1","title":"1) First of all sort both the file.2) Read a username from file1, say username1, Read a username from file2, say username2.3) If username1 = username2 then   print as output   else if username1 > username2 then      Read username from file 2 and say username2 and start step 3 again   else if username1 < username2 then         Read username from file 1 and say username1 and start step 3 again   If any of the file reading reach end of file. STOP program."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-1","title":"Sort the 2 files. O(n.log(n))Take one entry from the first file and do a binary search in the second file to find if it exists.    Go to the next entry in the first file O(log(n))   ....repeat the process"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-1","title":"find out manually"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=56632","download_status":"DOWNLOAD_DONE","votes":"2","answersCount":"34","title":"Had my first and second phone interview with Amazon. I was dropped. This site has been a great help towards my preparation and most questions are based on what you find here. Posting my Questions is a small way of saying Thanks!  Interview 1: 1. What is polymorphism. 2. Design an OO parking lot. What classes and functions will it have. It should say, full, empty and also be able to find spot for Valet parking. The lot has 3 different types of parking: regular, handicapped and compact. 3. Coding: I have an integer array where every number appears even number of times and only one appears odd times. Find the number. (I said hashtable and he asked me to write code with Hashtable) 4. What data structure would you use to look up phone numbers for customer names. (I said Hashtable. Asked why hashtable, why not a tree. I said HT has O(1). Asked is order always 1, when more than O(1) in HT.   Second Interview: 1. Starter: Describe your college projects. 2. OO Design: Design a deck of cards. What classes, data structures will you use? How will you shuffle the cards? How will you divide (deck) among players. What class/function do you need to denote players and where will you add them? What class/function do you need to deck? What if I need to add 2 jokers to the deck of 52 cards.  3. Data Structures: How will you use a hashtable to find data in a tree. (Then he rephrased) suppose I have a hashtable, I want to store the data in a tree instead of a bucket. How will I do it. What complexity to find an element.  4. Bits & Bytes: Find if a binary representation of a number is palindrome. The function should work irrespective of number of bytes for an integer. Suppose if our machine is 4 bytes for an int, how will you use the program for 8 byte machine.  5. Unix: Suppose I have 100's of html files in many directories. I want to find the files having phone numbers.   b) Suppose I have 2 files having phone numbers, find the repeating phone numbers. (I said sort and grep). Then he asked what if the lines cannot be sorted.   All the best guys. I think the second interview was challenging since the interviewer was prodding until he heard a leave me alone. So it means that though they are based on questions in cc, be prepared for extensions. I think this site is all you need to prepare for Amazon interview.","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"6","title":"3. Coding: I have an integer array where every number appears even number of times and only one appears odd times. Find the number.  XOR all the numbers together. The final result of XOR is your answer. O(1) space, O(n) time."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Design a deck of cards. What classes, data structures will you use? How will you shuffle the cards? How will you divide (deck) among players. What class/function do you need to denote players and where will you add them? What class/function do you need to deck? What if I need to add 2 jokers to the deck of 52 cards ---------------------------- ANS: Relation: 1 game -- 2 player , 1 deck ( atleast ) 1 deck - 52 cards. so entities are   Cards , Deck , Player , Game: class cards {   int rank;   int suits;   int type;   int name; };  Class Deck {   Cards *deck;   fill();   shuffle(); };  class Player {   int number_of_cards;   string name;   Cards play_card();   void collect_card(Cards C);   string get_name();    };  Class Game {   void play();   Player getWinner();   bool enough_cards };"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"hi S... I dont ur name .bt I would like to discuss some about design problem.If u have no problem .can u give me a call as soon as possible..just send me the acknowledgement  on my email Id on jigu4paint@yahoo.com.I will send my number.  I really need ur help.. Thanks"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"This Should help us a lot! Thanks for posting al the questions"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Design an OO parking lot. What classes and functions will it have. It should say, full, empty and also be able to find spot for Valet parking. The lot has 3 different types of parking: regular, handicapped and compact. ------------------------------------------------------------- Idea was number of parking car allotment can depend on parking type. User can put diff -2 algo to find the spot for diff parking type, ------------------------------------------------------------- class parking {   virtual bool full() =0;   virtual bool empty()= 0;   virtual bool spot_position()=0; };  class RegularParking:public Parking {   static int number_of_cars;   bool full() ;   bool empty()= 0;   int spot_position()=0; }; class HandicapedParking:public Parking {   static int number_of_cars;   bool full() ;   bool empty()= 0;   int spot_position()=0; }; class CompactParking:public Parking {   static int number_of_cars;   bool full() ;   bool empty()= 0;   int spot_position()=0; };"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"thanks a lot for sharing this!! it gave me a clear picture of how amazon photo interview looks like, very very helpful!"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Answer to Interview Qs # 3  package com.badal.HashTable;  import java.util.Hashtable;  public class HashTable3 {    public static void main(String [] args){   Hashtablehashtable=new Hashtable();     for(int i=0;i   if(hashtable.containsKey(Integer.parseInt(args[i]))){     hashtable.put(Integer.parseInt(args[i]), hashtable.get(Integer.parseInt(args[i]))+1);    }else{     hashtable.put(Integer.parseInt(args[i]), 1);    }    }      System.out.println(\"Start printing the hash table\");   for(int key:hashtable.keySet()){    System.out.println(key+\" = \"+hashtable.get(key));   }   System.out.println(\"End printing the hash table\");      for(int key:hashtable.keySet()){    if(hashtable.get(key)%2==1){     System.out.println(\"Odd occurence number is: \"+key);    }       }      }   }"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"3. Data Structures: How will you use a hashtable to find data in a tree. (Then he rephrased) suppose I have a hashtable, I want to store the data in a tree instead of a bucket. How will I do it. What complexity to find an element. ------------------ Ans: Is it a binary search tree? In that case, it will take O(logN) where N is the isze of the bucket.  5. b) Suppose I have 2 files having phone numbers, find the repeating phone numbers. (I said sort and grep). Then he asked what if the lines cannot be sorted. ---------------  We can use Hashing for this. Hash the phone numbers of the first file. Then take the 2nd file phone number and try to hash, if the element already exists in the Hash table, then print that phone number."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Mr Badal, What exactly are you trying to do ?"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"4. Bits & Bytes: Find if a binary representation of a number is palindrome. The function should work irrespective of number of bytes for an integer. Suppose if our machine is 4 bytes for an int, how will you use the program for 8 byte machine.  Solution: reverse the bits of the given integer and store it in another variable. Now check both the numbers whether they are equal or not. If equal the given number is palindrome otherwise not.  The code as follows: int input; // given input number - find palindrome or not int reverse_input = 0; // this will contain the no in which the bits are reverse order of the given input  while(input) {  int remainder = input % 2;  reverse_input = (reverse_input << 1) | remainder;  input = input / 2; }  // Now check if they are equal or not if(input == reverse_input) print \"Is Palindrome\" else print \"Not Palindrome\""},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"void reverseBits(int n) {  int rev = 0;  int o = n;  while(n)  {   rev = (n & 1) | rev;   n = n >> 1;   if(n)    rev =  rev << 1;  }  decimal_to_anybase(o,2);  decimal_to_anybase(rev, 2);  if(o == rev)   cout<<\"Palindrome\\n\";  else   cout<<\"Not palindrome\\n\"; }"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=1797","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"29","title":"Describe the classes and data structures you would use for a file system","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Just to get the ball rolling:class File{permissions user;permissions group;permissions other;char * owner;char *group int size;date created;date modified;char * name;char * extension;}class Directory:public File{List  filesInTheDirectory[];}class FileSystem{Tree  fileSystem;}"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Since File System is like a tree structure, I would say using Composite Pattern works here. Where the Component node will be directory and file will be a root node.  The base class which is composite node has methods like  -vector child. +addFile() +removeFile() -_lastmodified _creationtime"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"FAT is an easy one. Implement the FAT as a hash table of size n. I would use a Binary Tree for each FAT entry."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I think it's more about OOD, have a look at the \"Pattern Hatching\"Composite, Proxy, Mediator,Singleton Pattern are used to design the file system"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"is there more detailed explanation on this one? like what needs to be considered when designing a file system? what data strcutures to use and why not the others? Thanks!"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Could anyone give more details about this...?"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"A filesystem has a bunch of directories. Each directory has a bunch of files. A file can be a text file, binary file, etc."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"each file or directory has attributes like permission, last accessed, size,etc"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Class Directory inheriting from File is a bit odd. You should use composition instead of inheritance."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Just had an interview with Amazon..and first two questions were..What are the classes and data structures you would use for a file system  What kind of data structure would you use to implement a map (not a location map... But rather a mapping from a key to a value).Both of these questions were mentioned under Gayle's tips.  I think I bombed...in the interview...Any insight about the second question...?"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Just had an interview with Amazon..and first two questions were..What are the classes and data structures you would use for a file system  What kind of data structure would you use to implement a map (not a location map... But rather a mapping from a key to a value).Both of these questions were mentioned under Gayle's tips.  I think I bombed...in the interview...Any insight about the second question...?"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Map is usually implemented using a hash table or balanced binary tree (Red Black Tree is the popular tree data structures). If you know ahead of time how many elements are to be inserted and the number is small, an array would do the job. A Splay Tree would be a good data structures if there are some accessing pattern."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"What were some other questions that you received?"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"rest were simpler, code for reverse string ( the guy wasnt sure if i cud call a function like this...reverse_Str ( char src [], char dest [] ) but u can declare a function like this...bitwise operatorvirtul functionsinheritancemethod signaturesome other basic questions..."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Is there any place ( I already bought PIE after I blew it up ) where i can find similar set of questions....?"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Is there any place ( I already bought PIE after I blew it up ) where i can find similar set of questions....?"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Go through and solve all the questions on this website. This is the best preparation. I don't know any other good interview books. I recommend reading data structures and algorithms and design patterns books. I recommend Algorithms in C++ by SedgeWick, Effective C++ and More Effective C++ by Scott Meyers. The Algorithm Design Manual by Steven Skienna and the classic Introductions to Algorithms(CLR). Mark Weiss Data Structures and Algorithms book is very useful. If you read all these books and and solve all the questions on Gayle's website, I think you would have an easier time with these interview questions."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"For Design Patterns, read Head First Design Patterns. The style is silly and it works for me. This book definitely makes you think differently. Good luck!"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I was wrong. Vader is right. Since everything is really a File in Unix, A Directory has the same attributes as a File. Directory should inherit from File."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Pattern Hatching is used to  implement file system with classes........http://www.ida.liu.se/~uweas/Lectures/DesignPatterns01/panas-pattern-hatching.ppt."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"B-trees are commonly the underlying basis for modern operating systems. (Including NTFS and the Google File System)http://en.wikipedia.org/wiki/B-tree"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"To answer this question I would probably go into B-Trees and it's variants (B+ and B-) for the data structures of file systems. Not sure as far as classes go, but I imagine it's a little more complicated than having a list of files for a directory, and a tree/map of directories for a filesystem.As far as data structures for maps (ie. associative arrays), Red-Black trees is a good answer as well.Both of these are basically self-balancing binary trees, the knowledge of which is what I think what they are really after."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I'm thinking of going with Hashing all the data and then segregating the files into buckets. It gives O(1) complexity to traverse and since its hashed, searching would be easier. Within each bucket, data can be stored as B Trees.Plz correct me if i'm wrong anywhere.Thanks."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"class Directory:public File{ \nList  filesInTheDirectory[]; \n}"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Can someone provide me the link to Gayle's website for interview questions -- Thanks"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=3089709","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"24","title":"Given 5 classess Person, Head, Body, Arm, Leg, how will you relate all the 4 classes in a object oriented way?","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"3","title":"// How about this  class Person  {  string FirstName;  string LastName;  Body bd (); }  abstract class BodyPart {  int length;  int getLength ()  {   return length;  }  }  class Arm extends BodyPart {} class Hand extends BodyPart {} class Leg extends BodyPart {} class Head extends BodyPart {}  class Body {  Arm left();  Arm right();  Leg left();  Leg right();  Head head(); }"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Composition..."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"@David - very nice solution. Thanks"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I would add a List to the Person class, that would keep a single list of bodyparts as well. Otherwise the BodyPart abstraction is not used."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"//I think it's a case of composition.All the classes are related to eachother in a form of HAS-A relationship. Arm,Leg,Head are part of Body.If body ceases to exist,they will also cease to exist. Same with Person.Person IS NOT a body,Person has a body and furthermore, body object will come its its end if Person objects ceases to exist.   class Person     {         protected Body _body;         public void HasBody()         {            this._body = new Body();         }     }      public class Body     {          //Head,Arm,Legs are part of the Body Class         public Head _head;         protected Arm  _arm;         protected Leg  _leg;          public void SetHead()         {             this._head = new Head();         }          public void SetArm()         {             this._arm = new Arm();         }          public void SetLeg()         {             this._leg = new Leg ();         }     }      public class Head     {          //Whatever code     }      public class Arm     {          //Whatever Code     }      public class Leg     {          //Whatever Code     }"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-1","title":"A good model is probably not possible with object-oriented modeling."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-1","title":"i think use arm,leg,head as base class inherit into body class which is inherited into person class.."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-1","title":"I think.... Person consists of all the other classes with better explanation done."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-2","title":"These can be related by polymorphism. Person becomes the parent class. Body, Head, Arm, Leg all inherit Person as a person contains all of the 4. So by inheritance, Body, Head, Arm, Leg became of \"Person Type\". Any pointer or reference of Person Type can now point to these four class objects too. Using Virtual functions we can call object specific member functions which override the parent member. Eg."}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=6210203154382848","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"16","title":"Given a list of test results (each with a test date, Student ID, and the student??s Score), return the Final Score for each student. A student??s Final Score is calculated as the average of his/her 5 highest test scores. You can assume each student has at least 5 test scores.  You may use the JDK or the standard template library. The solution will be evaluated on correctness, runtime complexity (big-O), and adherence to coding best practices. A complete answer will include the following:      Document your assumptions     Explain your approach and how you intend to solve the problem     Provide code comments where applicable     Explain the big-O run time complexity of your solution. Justify your answer.     Identify any additional data structures you used and justify why you used them.  class TestResult{    int studentId;    Date testDate;    int testScore; }  public Map getFinalScores(List resultList){    return null; }","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"3","title":"import java.util.ArrayList; \nimport java.util.Date; \nimport java.util.List; \nimport java.util.Map; \nimport java.util.PriorityQueue; \nimport java.util.TreeMap; \n \npublic class StudentScore { \n \n public static Map getFinalScores( \n   List resultList) { \n \n  Map> topFives = new TreeMap<>(); \n \n  for (TestResult res : resultList) { \n   PriorityQueue topFive = topFives.get(res.studentId); \n   if (topFive == null) { \n    topFive = new PriorityQueue(); \n    topFives.put(res.studentId, topFive); \n   } \n   topFive.add(res.testScore); \n   if (topFive.size() > 5) { \n    topFive.poll(); \n   } \n  } \n \n  Map finalScores = new TreeMap<>(); \n  for (int id : topFives.keySet()) { \n   double total = 0.0; \n   for (int score : topFives.get(id)) { \n    total += score; \n   } \n   finalScores.put(id, total / 5.0); \n  } \n \n  return finalScores; \n } \n \n public static void main(String[] args) { \n  int[][] scores = { { 2, 78 }, { 2, 89 }, { 2, 97 }, { 2, 92 }, \n    { 2, 99 }, { 2, 66 }, { 2, 23 }, { 3, 78 }, { 3, 89 }, \n    { 3, 87 }, { 3, 92 }, { 3, 98 }, { 3, 66 }, { 3, 23 } }; \n \n  List resultList = new ArrayList<>(); \n  for (int[] score : scores) { \n   resultList.add(new TestResult(score[0], score[1])); \n  } \n \n  System.out.println(getFinalScores(resultList)); \n \n } \n} \n \nclass TestResult { \n int studentId; \n Date testDate; \n int testScore; \n \n TestResult(int id, int score) { \n  studentId = id; \n  testScore = score; \n } \n}"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Use a map containing for each user a min heap with a size of 5. after that calculate for each user. Complexity n * log(5) == O(n)"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Use Map + MaxHeap  Link: github.com/techpanja/interviewproblems/tree/master/src/heaps/heap"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Assumptions: 1) The student id are in the range (0-max role number for students) with out any gaps.  2) To achieve constant insertion time to the map we use studentId as the key. So we assume that we have a hashmap with initial capacity = max role number for students 3) test scores are in the range of [0-100]  Approach: Lets say there is an object called TestResult which encapusulates testdate, studentId, testscore. These test results are stored in a hashmap with student id as the key      Map perStudentResults = new HashMap  Before we declare the score per student, heapify the results per student as a max heap. Once made as a max heap, get the max element 5 times and perform the average of the score and display it as the score.  Complexity: If there are n students p results for each students,  * Insertion to the hashmap for n student records -> O(n*p) * Heapify operation for p elements can be done in O(p). The heapify operation for n student is again n* O(p) = O(n*p) * For each student        for i = 1 to 5            * retrieve the max element and rearrange the heap = O(logp)            * Compute the average so far        end   end   Complexity here will be O(n*5logp) = O(nlogp)    * finally the complexity is O(n*p)"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"public Map getFinalScores(List resultList) { \n \n Map finalScores = new HashMap(); \n for (TestResult result : resultList) { \n     if (finalScores.containsKey(result.studentId)) { \n  finalScores.put(result.studentId, finalScores.get(result.studentId) + result.testScore); \n     } else { \n  finalScores.put(result.studentId, Double.valueOf(result.testScore)); \n     } \n \n } \n  \n return finalScores; \n    }"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"import java.util.*; \n \npublic class TestResult implements Comparable { \n \n    int studentId; \n    Date testDate; \n    int testScore; \n \n    TestResult(int id, Date dt, int score) { \n        studentId = id; \n        testDate = dt; \n        testScore = score; \n    } \n \n    @Override \n    public int compareTo(TestResult o) { \n        if (studentId > o.studentId) \n            return 1; \n        else if (studentId < o.studentId) \n            return -1; \n        else \n            return 0; \n    } \n \n    public Map getFinalScores(List resultList) { \n        Map result = new HashMap(); \n        Collections.sort(resultList); \n \n        int prevId = resultList.get(0).studentId; \n        ArrayList scores = new ArrayList(); \n \n \n        System.out.println(\"Result\"); \n        int len = 0; \n        for (TestResult t : resultList) { \n            len++; \n            if (prevId != t.studentId || resultList.size() == len){ \n                result.put(prevId, getAverageTopFiveScore(scores)); \n                System.out.println(prevId + \" \" + getAverageTopFiveScore(scores)); \n                prevId = t.studentId; \n                scores = new ArrayList(); \n                scores.add(t.testScore); \n            } \n            else { \n                scores.add(t.testScore); \n            } \n        } \n \n        return result; \n    } \n \n    public double getAverageTopFiveScore(ArrayList topFiveScores) { \n        Collections.sort(topFiveScores, Collections.reverseOrder()); \n        int sum = 0; \n        for (int i = 0; i < 5; i++) { \n            sum += topFiveScores.get(i++); \n        } \n        return sum / 5; \n    } \n \n \n}"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"class TestResult{  \nint studentId;  \nDate testDate;  \nint testScore;  \n}  \n \npublic Map getFinalScores(List resultList){  \n // test if input list if null or empty \nif(resultList != null || resultList.isEmpty()) { \n  // Sort using an O(nlogn) runtime sorting algo \nArrays.sort(resultList, new TestResultComparator()); \n  Map averages = new HashMap(); \n  int count = 0; \n  for(int i = 0 ; i 5) { \n     continue; \n    } \nelse if(count == 5) { \n     int avg = (averages.get(resultList.get(i).studentId) +resultList.get(i).testScore) /5 ; \n     averages.put(resultList.get(i).studentId, avg); \n     count++; \n    } else { \n     int acum = averages.get(resultList.get(i).studentId) +resultList.get(i).testScore; \n     averages.put(resultList.get(i).studentId, acum); \n     count++; \n    } \n   } \n  } \n } \n  \n return null; \n} \n \npublic class TestResultComparator implements Comparator { \n @Override \n public int compareTo(TestResult o1, TestResult o2) { \n  if(o1 == o2) \n   return 0; \n  if(o1.studentId = o2.studentId) { \n   return o1.testScore == o2.testScore ? 0 : o1.testScore > o2.testScore? 1 : -1; \n  } \n  return o1.studentId > o2.studentId ? 1 : -1; \n }"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"The idea is to store information about every student in Map, where key is Student ID. Value of this Map is a special structure where the best 5 results are in PriorityQueue, but other are in some simple collection (like list).  So when we need to add new item we check if PriorityQueue has 5 items. If it has less - just add new item, otherwise we peek top item which is the worse among best 5 and compare it with given. After that we put new item to list or to priority queue (and put in list top heap item)  So add operation takes O(log 5) == O(1) constant time"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=13422665","download_status":"DOWNLOAD_DONE","votes":"1","answersCount":"15","title":"Design a multiple elevators system of skyscraper. Design an algorithm to let person find available elevator soon. How to improve your algorithm?","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"3","title":"Why is everyone writing a lot of code? This is a design question. Writing classes and explaining how they interact with each other is sufficient. Also why assume there are 4 elevators? Assume there is just one bidirection elevator and it supports basic operations, you can always make it fancier later."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Interesting question. This    Let's solve  First examplify  Consider this scenario There are 4 elevators in the Sky  scraper Each elevator either goes up or down Each elevator  can stop at any of the levels 0-320(it's the words tallest building) Your man is at level 0  Write test case E1 is at level10 and is going up  E2 is at level 100 and is going down  E3 is at level 200 and is going down E4 is at level 69 and is going down  It is quiet obvious from the above that E4 will be the first to arrive So for each elevator we have to consider up down and level this would give method signature  Public elevatorNode  pollElevator( int elevatorno)   Public void elevatorNode(Boolean direction,int  level)   A monitor that polls each elevator based on a timer based on round robin fashion will give closest elevator  Public sychronized void getClosest()              // poll each node using wait notify              // add each node level and elevatorno with boolean true for down to map              // sort map by level              // Get value at 0 return elevator number"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Ps also an excellent case for observer observable pattern"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"class ElevatorManager \n{ \n Elevator elevatorArray[ELEVATOR_COUNT]; \n // List of pending hallcalls \n HallCallList hallcallList_; \n \npublic: \n // User API to intiate a hall call \n void ProcessHallCall(const HallCall& rHallCall); \n \nprivate: \n // Starts the Hall Call Process Thread \n void StartHallCallProcessThread(); \n // Create thread for each elevator to make it operational \n void StartCarMovementThread(); \n}; \n  \nvoid ElevatorManager::ProcessHallCall(const HallCall& rHallCall) \n{ \n hallcallList_->AddHallCall(rHallCall); \n} \n \nElevatorManager::StartHallCallProcessThread() \n{ \n HallCallProcessThread thread(elevator, hallcallList_); \n thread.run(); \n thread.detach(); \n} \n \nElevatorManager::StartCarMovementThread() \n{ \n for (int i = 0; i < ELEVATOR_COUNT; i++) \n { \n  ElevatorThread thread(elevatorArray[i]); \n  thread.run(); \n  thread.execute(); \n } \n} \n \n \n////////////////////////////////////////////////////////////////////////////////// \n \n// class encapsulating the hallcall list treatment \nclass HallCallList \n{ \n list lHallCallList_; \n Mutex mHallCallListMutex; \npublic: \n void AddHallCall(HallCall hallCall); \n HallCall PopHallCall(); \n}; \n \nHallCallList::AddHallCall(HallCall hallCall) \n{ \n MutexLock(mHallCallListMutex); \n lHallCallList_->push_back(hallCall); \n hallCallListSemaphore->signal(); \n} \n \nHallCall HallCallList::PopHallCall() \n{ \n MutexLock(mHallCallListMutex); \n Hallcall hallcall = lHallCallList_->front(); \n lHallCallList_->erase(lHallCallList_.begin(), lHallCallList_.begin()); \n return hallcall; \n} \n \n////////////////////////////////////////////////////////////////////////////////// \n// Creates one thread per hallcall so that non-interfering hall calls can work parallely \nHallCallProcessThread::Execute() \n{ \n hallCallListSemaphore->signal(); \n MutexLock(mHallCallListMutex); \n Hallcall hallcall = hallcallList_->pop(); \n OneHallcallThread thread(hallcall, hallcallList_); \n thread.run() \n thread.detach(); \n} \n \nOneHallcallThread::Execute() \n{ \n bool bCallProcessed = false; \n        // Sorted Elevator Array sorts the provided elevator array based on the current requested hallcall floor. \n       // We want to try out the elevator which is nearest \n SortedElevator elevatorArray(elevatorArray, hallcall); \n FOR_EACH elevator in elevatorArray \n { \n  if (true == elevator->ProcessCall(hallcall)) \n  { \n   bCallProcessed = true; \n   break; \n  } \n } \n \n // If currently no elevator can process the hallcall \n // it is added back to the hallcalllist \n if (false == bCallProcessed) \n { \n  hallcallList_->AddHallCall(hallcall); \n } \n} \n \n \n///////////////////////////////////////////////////////////////////////////////////////////// \n \nclass Elevator \n{ \n typedef int FLOOR; \n typedef list DestFloorList; \n Mutex elevLock; \n Semaphore destFloorEmptySem; // To put elevator thread into wait state when no hallcall \n DestFloorList lDestFloorList_; \npublic: \n Elevator() : elevLock(1), destFloorEmptySem(0); \n void ProcessCall(Hallcall hallcall); \n void Move(); \n  \nprotected: \n void Reset(); \n void UpdateCurrentFloor(); \n}; \n \nElevator::ProcessCall(HallCall hallcall) \n{ \n Mutexlock lock(elevLock); \n \n // Logic to find if the elevator can process the request \n if ((this->state == STATIONARY) ||  \n  ((this->state == UP) && (hallcall.direction == UP) && (this->currFloor < hallcall.floor)) || \n  ((this->state == DOWN) && (hallcall.direction == DOWN) && (this->currFloor > hallcall.floor))) \n { \n  this->lDestFloorList_->push_back(hallcall.floor); \n  this->destFloorEmptySem_->signal(); \n  return true; \n } \n \n return false; \n} \n \nElevator::Reset() \n{ \n this->state = STATIONARY; \n this->currFloor = 0; \n this->lDestFloorList_ = empty List; \n} \n \nElevator::UpdateCurrentFloor() \n{ \n Mutexlock lock(this->elevLock); \n Floor targetFloor = this->lDestFloorList_->front(); \n if (this->currFloor > targetFloor) \n { \n  this->state = DOWN; \n  this->currFloor--; \n } \n else if (this->currFloor < nextFloor) \n { \n  this->state = UP; \n  this->currFloor++; \n } \n} \n \nElevatorThread::Execute() \n{ \n elevator->Move(); \n} \n \nElevator::Move() \n{ \n this->Reset(); \n while(true)  \n { \n  if ((this->state == UP) ||  (this->state == DOWN)) \n  { \n   floor = this->lDestFloorList_->top(); \n   if (floor == this->currFloor) \n   { \n    { \n     Mutexlock lock(elevLock); \n     this->lDestFloorList_->pop_front(); \n     this->state == STATIONARY; \n    } \n    this->destFloorEmptySem_->wait(); \n    this->UpdateCurrentFloor(); \n   } \n   else \n   { \n    this->UpdateCurrentFloor(); \n   } \n  } \n  else \n  { \n   this->destFloorEmptySem_->wait(); \n   this->UpdateCurrentFloor(); \n  } \n  sleep(5); \n } \n}"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Prior to code implementation, generally you should clarify  - How many floors the skyscraper has? - How many elevator halls it has? - How elevators are consistent of? (Normally, there should be different types of elevators like workers only, 0-10th floor, 10-20th floor, skip even number or something like) - How about the max capacity? (How much weight) or etc..."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I tried the design of a single elevator and extended that to multiple elevators scenario. Given that i am not able put class diagrams here  i have put it here  h%t%t%p://thought-works.blogspot.in/2012/11/object-oriented-design-for-elevator-in.html (remove % in the url and paste in the address bar )  This is one of the interesting questions and discussion on this would benefit many folks like us who want to learn design."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"We can create a state and event machine for each elevator in procedural design    elvator [ MAX_State] [Max_event]  state are static , moving up and moving down and event are perssing of buttons (inside the lift and outside the lift) . We can write the call back functions for all the state and event machines ."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I don't know if it's the same person but someone, is going and posting Observer pattern on almost all OODesign questions."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"he loves observer...."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"execuse me... iam doing a project on elevator control system using fpga. in that project in didn't understand the how to take timer operations for the lift... plz help mee..."}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=1812","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"15","title":"How would you implement a map (not a map of like a city... just a set of keys which \"map\" to values\")- Give two data structures you could use- What is average and worst case insert time, delete time, look up time - What are pros/cons of each","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"- hashtable(an unsorted linked list is used for handling collision.)insert: O(1)delete: O(n)lookup: O(n)- linked listinsert: O(n)delete: O(n)lookup: O(n)"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"map restricts key-value mapping to 1:1 .. so u cant have duplicate keys. u could use hashing .. all constant time operations and trees O(lg n) operations"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"- Give two data structures you could use  1. HashMap using hash table (unsorted map) 2. TreeMap using Red-Black Tree (sorted map)- What is average and worst case insert time, delete time, look up time 1. for HashMap: average O(1) worst O(N) 2. for TreeMap: average O(log N) worst (unbalanced) O(N)- What are pros/cons of each 1. for HashMap: speed 2. for TreeMap: sorted"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"The simplist one to use is an array.lookup: O(1)delete: O(n) due to shiftinginsert: O(n) due to shiftingavg: O(n)Cons:Too many mem writes when shifting.Pros:Least mem overhead for lookup.Hashmap and Treemap are good ones too."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Jason, RB tree is balanced. so the wosrt case for insert, delete, and lookup time is O(log N)"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"For linked list, why does deletion and insertion need O(n)? It should be O(1). For example, When i do deletion on a given element, I can just copy the next node info to the memory of the delete element, and free the mem of the next node. It is O(1)."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"For insertion or deletion in a linked list, we have to traverse through the list...so the complexity is O(n)"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Use a red black tree"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=10808830","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"14","title":"There are 3 products table,chair and bench. Product can be of wood ,metal and plastic . Design a class structures for this.","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"It's tempting to make a simple model of abstract product where material is modeled as enum. However, a more complicate URL is abstract factory. This is depends on functions the interviewer want. If all function is material cost, the enum is sufficient. If there are more than just a cost such as strength, assemble manual, etc. or you might want to have sale a patio set. Then, abstract factory is a better choice."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"public abstract class Furniture {      int length;      int breadth;      int height;      RawMaterial type; }    class Table extends Furniture {   }  class Chair extends Furniture {   }   enum RawMaterial {  WOOD,METAL,PLASTIC; }"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Decorates will be useful when u are trying to extend some property of object not modify, here we might need totally different implementation for these products. The answers to this question might be very specific depending on interviewers thinking, but to start with one suggest a generic class:"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"let me layout an idea here.  Please read through the complete solution patiently.  We will define a high level class called \"part\".  Now every part will have a list of pointers to other \"parts\". The \"part\" class will have an evaluate function  which will evaluate the entire part (part and its sub parts)  based on its atributes,dimensions,etc.   class part { char* inputMaterial; part* subparts[10];  void Evaluate();/*Evaluates a part and the sub part*/ }    class chair : part {  int _height; int _base_length; int base_width;  chair(char* material,char* config_string /*\"seat backrest leg1 leg2\"*/) { if(material==\"plastic\") { _height=20; _base_length=40; _base_width=60; if(config_string.Substr(\"seat\") { table->subparts[0]=new seat(\"plastic\",_base_length,_base_width); }  if(config_string.Substr(\"backrest\") { table->subparts[1]=new backrest(\"plastic\",_height); }   if(config_string.Substr(\"leg1\")) { table->subpart[2]=new leg1(\"plastic\",(_height/2)); }   if(config_string.Substr(\"leg2\")) { table->subpart[3]=new leg2(\"plastic\",(_height/2)); }    if(config_string.Substr(\"\")) {   } }   class seat :part { seat() { /*uses interface material to source plastic beams */ } }  The key thing to note here:  1) The type is defined at run time,what class type defines chair:     a chair is an object of type: seat,backrest and two legs.     Note that based on user input we will decide the type of chair will not constitute armrests. 2)  the \"part\" is an atomic entity that helps you define your type. So your chair type is defined      in terms of a collection /set of parts  3) why create run time types ?     It helps you set a policy for evaluating constraints. For. (E.g). you could create constraints across sub parts     ( In the above example, the length of legs could be twice the height used for backrest). and.. you could create     constraints from parents to children ( from chair to leg,leg's position =chair's position + (30,40,50) )     now lets say  we modify the chair's position, we obviously evaluate the chair,now becoz the legs are part of my chair     (our type definition for chair: seat,backrest and two legs) the legs move along with my chair.      you don't have to evaluate the legs separately, they have already moved !!       But if you modify the backrest's height, of course the legs constraints say the leg's height will also have to change.      a modify of backrest will trigger evaluate on backrest. This DOES NOT CHANGE the leg's height.      The leg's height will change only when either the leg is evaluated or when the whole chair is evaluated.             In practical scenarios, this lets some one working on the \"leg\" module to continue until he is \"ready\" to accept the update       changes from outside (in this case , the backrest)   Its' long., but hope it makes sense. I dont understand why amazon asks these questions!"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Create 3 arrays and corresponding to each array create a hash map...each hash map will  contain the adreess of the doubly linked list...same as LRU cache implementation..."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Create an interface for Type of furniture as :"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-2","title":"I think in this case the decorate design pattern will be a good choice to design the class structure. Make table, chair and bench as subclasses of a common superclass, and wood, metal and plastic as decorators."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-3","title":"Strategy pattern.  we have to create 3 interfaces (table,chair, bench) and for each interface,  3 concrete class."}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=173901","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"14","title":"Design a deck of cards.  Write code for Shuffle() method.","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Classic!"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"private void Shuffle(int seed) {    Random r = new Random(seed);    for(int i=51; i>0;i--)    {       int x = r.nextInt(i);  // picks from 0...i       swap cards x and i;    }    }"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"One simple solution is, assign random number to each card. and then sort the deck."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"excellent work above. Thanks."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"You're welcome. About the shuffle method, mine does it in O(n), sorting will do it in O(nlogn)"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"simple and smartest solution is to assign random number ( as some one already mentioned) and then make a BST of those numbers...so we're done in O(n)...as traversing the full list takes no more than O(n)...done!"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"isnt it that in shuffle, ith cell goes to (2i%l) th position ?"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"@bebo ??????   test case guys : when after shuffling comes back to original state."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"@ Anonymous :  Cool Stuff bro/sis!!!"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"x=0; \nwhile input list empty { \n  r= Random(x,n) \n  Place rth element in xth position of the output list \n  Delete entry for rth element in the input list \n  x++ \n} \nreturn output list."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"@Ankush Bindlish on September 04, 2009: I guess you're not supposed to delete the element at the rth position as in that case you loose that element, so I guees you meant exchange the elements at x and r positions. right???"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=65911","download_status":"DOWNLOAD_DONE","votes":"1","answersCount":"14","title":"How do you represent the following expression in \"class design\": (5*3)+(4/2) ? How would an algorithm that computes the value of this expression work?","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"class expression {    expression m_data; public:     expression(int a):m_data(a){}     expression expression::operator+(expression a,expression b);                                    -,*,/     expression expression::operator()(expression a); }"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"1)change it expression to binary tree which take the operator as the root of each nodes 2)traverse the tree with post-order. 3)traverse the result with stack.   when met the operator,pop up the topmost 2 values and calculate it,then push the result into the stack."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"read the input character by character, first convert the infix expression into a postfix expression using a stack and adhering to precedence rules. Once the postfix expression is ready, evaluate the expression using a stack"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"aaah, this is a piece of cake!!! u can do this in O(n) time... -create a postfix -evaluate the result  if u need more email me at chrisogonas@yahoo.com"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Chrisogonas's comment is quite silly, IMO. Practically useless(the comments before have alluded to postfix notation) and claiming that it is easy is idiotic.  Create postfix: how? Use the shunting yard algorithm.  Evaluation, you push onto stack till you see operator, in which case you pop the required number of arguments which the operator takes from the stack, evaluate and push back the answer on the stack."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"1. construct (5 * 3) + (4 /2) into a binary tree, where the inner nodes are operators. 2. construct a post order of the tree: 5 3 * 4 2 / +  3. evaluate: push numbers in stack. when meets a operator, pop number of operands this operator needs from the stack, push the evaluation result into stack. Repeat until post order string is finished:  (1)push 5, push 3, meet *, which needs two operands. Pop, pop. Evaluate result is 15, push into the stack. (2)push 4, push 2, meet /, which needs two operands. Pop, pop. Evaluate result is 2, push into the stack. (3)meet +, which needs two operands. Pop, pop. Evaluate result is 17. push into the stack. (4) end of the string. Pop. return as result."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"The above algorithm assuming the post order traversal is correct, would lead to 15 being pushed into the stack followed by 4 and 2, and then the operator / being encountered.  At this point, 15 will be divided by 4. Not the right result."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"The above algorithm assuming the post order traversal is correct, would lead to 15 being pushed into the stack followed by 4 and 2, and then the operator / being encountered.  At this point, 15 will be divided by 4. Not the right result."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Be careful this is not a data structure question, this is OO. So  abstract Class Operation class Multiplication class Division class Addition  all implementing the abstract method calculate()  So algo is : Operation op1 = new Multiplication(5, 3) Operation op2 = new Division(4, 2) Operation op3 = new Addition(op1.calculate(), op2.calculate())"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"result = op3.calculate()"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Use a composite design pattern:"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=5183557542608896","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"13","title":"Design a OO system for furniture where there are wooden chairs and tables, metal chairs and tables. There are stress and fire tests for each products.","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"3","title":"Does the below design sounds reasonable?"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Abstract Classes: Chair, table Concrete Classes: metal chair, wooden chair, metal table, wooden table Interface: stressTest(), fireTest()"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"I feel like no one has done this yet. But here is my code:"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"public interface Furniture {     public boolean stressTest();     public boolean fireTest(); } public class FurnitureItem implements Furniture { protected double weight;                                                                                                 protected dementions;   //those can be height weight width etc                                                                    public void stressTest(); public boolean fireTest(){//general tests for the furni} public boolean stressTest(){//general tests for the furni} } public  class Chair extends FurnitureItem { //constructors and new variables added as per the requirements  with super keyword //if posssible private //getters and setter public String toString() { //say print chair                                                                                                                                                     public  String stressTests(){//general }public void fireTest(){//general fire tests for the chair} } public boolean fireTest(){super();//general tests for the chair} public boolean stressTest(){super();//general tests for the chair}  } public  class Table extends FurnitureItem { //constructors and new variables added as per the requirements  with super keyword //if posssible private //getters and setter public String toString() { //say print Table                                                                                                                                                    public  String stressTests(){//general }public void fireTest(){//general fire tests for the chair} } public boolean fireTest(){super();//general tests for the Table} public boolean stressTest(){super();//general tests for the Table}  }  public class MetalChair extends Chair { //more private variable with getter and setter public along with the constructors      @Override     public boolean stressTest() { super();         //specific to metal chairs     }      @Override     public void fireTest() {         super();         //specific to metal chairs     }   public String toString()  {  super();   //say print type as metal                                                                                                                                                     public  String stressTests(){//general }public void fireTest(){//general fire tests for the chair}    }  }  public class MetalTable extends Table {    //more private variable with getter and setter public along with the constructors      @Override     public boolean stressTest() { super();         //specific to metal table     }      @Override     public boolean fireTest() {        Value =super();         //specific to metal table return if everthing is true;     }   public String toString()  {  super();   //say print type as table                                                                                                                                                     public  String stressTests(){//general }public void fireTest(){//general fire tests for the chair}    } }   public class WoodenTable extends Table {     //more private variable with getter and setter public along with the constructors      @Override     public boolean stressTest() { super();         //specific to metal table     }      @Override     public boolean fireTest() {        Value =super();         //specific to metal table return if everthing is true;     }   public String toString()  {  super();   //say print type as table                                                                                                                                                     public  String stressTests(){//general }public void fireTest(){//general fire tests for the chair}    } }   public class WoodenChair extends Chair {    //more private variable with getter and setter public along with the constructors      @Override     public boolean stressTest() { super();         //specific to metal table     }      @Override     public boolean fireTest() {        Value =super();         //specific to metal table return if everthing is true;     }   public String toString()  {  super();   //say print type as table                                                                                                                                                     public  String stressTests(){//general }public void fireTest(){//general fire tests for the chair}    } }   public class FactoryClass {     public static void main(String[] args){         //array of furnitureItems for(FurnitureItem f: array) { sysout(tests); }      }         public static Furniture buildFurniture(String model) { //java 7   FurnitureItem furni= null;   switch (model) {   case MetalChair:    furni= new MetalChair();    break;    case woodenchair:    car = new woodenchair();    break;    case MetalTable:    car = new MetalTable();    break;                  case woodenTable:    car = new woodenTable();    break;    default:    // throw some exception    break;   }   return car;  }  }"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Ideal place to use strategy patter..encapsulate what changes...i.e Testsuite type in a class Furniture which is inherited to concrete types chair and table"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I like what some people have suggested to avoid class explosion. Based on that, I have come up with this basic structure. Mind you that there can be many more details added. For instance, for chair, if the back rest breaks first on applying pressure or which leg breaks first. Of course, I haven't really written the class that drives the tests either"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=12705691","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"13","title":"Why data members are private when we can access them through getter/setters?. Why can't we just make them public.[ How will you convince the interviewer]","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"8","title":"There can be different reasons why data memebers are private while we can access them through getter/setter. The main reasons to keep data members private comes from Data Abstraction principle.  - The abstract properties(so called getters/setters here) are those that are visible to client code that makes use of the data members (the interface to the data members) while the concerete implmenetation is kept private and indeed can change.  -- The idea is that such changes are not supposed to have any impact on client code ( called Localization of  Change). Code that uses the object in question will not need to be edited if the implementation of the object is chnaged. since any changes to the implmentation must still comply with the interface and since client code using object may only refer to properties and abilities specified in the interface as changes can be made to the implmentation without requiring any changes in code where the object is used. -- The uses doesn't need to know any technical knowledge of how the implementation works  to use an object. The implementation can be complex but will be encapsultaed (Encapsulation) in a simple interface. For e.g. if we talk about a Banking system, there can be Account class which may have complex implementation, how the account balance is changed. User of this class should not be allowed to access the balance (data member) directly and modify; but using the properties (interface to the data members), you may enforce certain rules how balance can be modified)   keeping data members private also makes your object secure from malicious software which may instantiate the object and perform directly some manipulation on data members. If it goes through properties (getters/setters) you may have some control.   Using above Account class example, the malicous software may not be able to set the account balance to large arbitrary value as with getters and setters you may have some validation plus you may never expose setters for such important data members.   They can only be accessed by the operations which will have all those validations/rules which disallows to set a Account balance to a high arbitrary value. Going through properties/operations will also make a log of the activities."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"See private class data pattern:  sourcemaking.com/design_patterns/private_class_data"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"In addition to controlling access, getters and setters can also be used to perform post or pre-processing on variables.  For example, if you have a Rocket::getSpeed() method which returns the speed in km/h, you can switch internally (inside Rocket) between storing the speed in km/h or m/s without affecting clients of Rocket, as long as you do the appropriate conversions inside getSpeed().  In a setter method, you can perform error checking before allowing assignment. For example, checking that a given speed is <= c inside Rocket::setSpeed"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"data-members are made private and accessed thru getter and setter methods for pre-processing....edsouza is right....  Suppose we are storing age of a person and v declare that as public. Now any body can access that and can write age = -39 ( as age can't be negative) so this is logically incorrect though your code allows it.  There are 2 solution for avoiding this basically validating the value.  1.) use validation code inside constructor and initialize variable in that. But this is not preferred as every time object is created it will check for the validation.  2.) Use getter/setter methods and put validation code there itself....."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"when we have integer divisions say in any software designed for Civil Engineers or Architects..where there may integer divisions and if the user enters the Zero for denomination..the it bcoms divide by zero exception..run time error...such validations can be taken care in those accessors and mutators"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Getters and Setters are useful in following cases. 1. To add validation code (Already mentioned above) 2. Making members public makes debugging very difficult. You can add breakpoints in getters and setters easily."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-1","title":"Data members are operated in member functions of that particular class... If this is accessible to every class then we can declare that variable as global."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-2","title":"The answer lies in inheritence. Private members won't be inherited."}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=7842664","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"13","title":"There is a Furniture class and has derived classes like WoodChair,WoodTable,SteelChair,SteelTable. She wants to add more number of classes like ironchair,irontable etc; How would you do that. The design is not yet published and you are free to modify the entire sutff given.","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"2","title":"public interface Furniture  \n{ \n public String getFurnitureType(); \n} \n \n \npublic class SimpleFurniture implements Furniture{ \n public String getFurnitureType() { \n  return \"Simple Furnitue\"; \n } \n} \n \npublic abstract class FurnitureDecorator implements Furniture{ \n  \n protected Furniture simpleFurniture; \n  \n public FurnitureDecorator() { \n } \n  \n public FurnitureDecorator(Furniture f) { \n  this.simpleFurniture = f; \n } \n  \n public String getFurnitureType() { \n  return simpleFurniture.getFurnitureType(); \n } \n \n} \n \npublic class Table implements Furniture { \n  \n private Furniture fTable; \n  \n public Table() {  \n   \n } \n  \n public Table(Furniture f) {  \n  fTable = f; \n } \n  \n public String getFurnitureType() { \n  return fTable.getFurnitureType() + \" Table Furniture \"; \n } \n \n} \n \npublic class TableWithWoodDecorator extends FurnitureDecorator{ \n \n protected Furniture f; \n  \n public TableWithWoodDecorator() { \n } \n  \n public TableWithWoodDecorator(Furniture f1) { \n  f = f1; \n } \n  \n public String getFurnitureType() { \n  return f.getFurnitureType() + \" with wood\"; \n } \n  \n  \n} \n \npublic class TestFurniture { \n \n public static void main(String[] args) { \n   \n  Furniture f = new TableWithWoodDecorator(new Table(new SimpleFurniture())); \n   \n  System.out.println(f.getFurnitureType()); \n   \n   \n } \n}"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"I would go with two base interface ,  IFurniture  {  void Init(IMaterial) }  IMaterial { }  Now I will create furniture objects,  abstract class Chair : IFurniture { }  abstract Class Table : IFurniture { }  Class WoodMaterial : IFurniture { }  class SteelMaterial : IFurniture { }  Concrete classes  class WoodenChair:: Chair {  Init(IMaterial material) }"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"My response was to create a interface as material to generalize or to add material appropriate stuff in common for all classes instead of adding subclasses again and again."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"You might be better off having furniture as an abstract base class and then Table and Chair as its subclass with an attribute of material."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"abstract factory pattern"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Furniture : Abstract Class Furniture -> Table  Furniture -> Table -> IronTable Furniture -> Table -> SteelTable Furniture -> Chair Furniture -> chair -> Woodchair Furniture -> Chair-> Steel chair"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"1) Abstract Class Furniture { Material material; } 2) table extends furniture  3) chair Extends furniture  4) Material  5) Wood implements material; 6) Iron Implements material;"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Strategy pattern can be used for this need."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"How Strategy Pattern??? Can you elaborate?"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Decorator pattern"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=3031","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"13","title":"How would you design the data structures for Notepad?  Specifically, how would you write a string to it efficiently (eg, edit)?","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"2","title":"ROPE data structure is used generally for the text editors"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Ramu:I think Linked List is not efficient because, how would you get the a particular line directly; you need to traverse the from the starting of the list to get it."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"I guess, Here linked list means, double linked list. If we use double linked list then we can traverse in both directions. if we want to go to another line, then also it can movable.wt you say?"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Yes, doubly linked lists should work!Also, if we are to maintain line numbers, on inserting a new line somewhere in between, we need to update the line numbers on all the lines following it. This is linear ofcourse.We could use an index on line numbers. So we could retrieve the line in constant time from this index. However, on inserting a new line we need to update the index. This is linear again."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I would probably design a class with following minimal properties1. a string to represent the name of the notepad 2. a hash map with key as line number and value as the entire string. Methods for the Notepad class:1. edit(int line_number):  this function should pull up the string from hash map based on the line number and re-write the entry.Above proposed method is just a skeleton, there could be many more additions to it."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I would suggest that we use a linked list to store the element that is strings. Then we would also store the strings in a suffix tree. This tree not only has the words but also has the value that indicates the position of the string stored in the linked list. Thus it would become easy to search a string and also store the data.This is a memory consuming solution but effective in actions like cut, copy, paste and also in searching in notepad."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"will a doubly linked list work when the user just jumps back and inserts a character in between. how bout using the StringBuffer class of java to represent the entire contents"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I do not understand why one should load the whole content in a map (hashtable or tree etc). Even though it will give you time-efficiency but think of the memory requirement. Imagine you want to view a production-log file of huge size, say 4GB. Do you think you can load that in RAM. In fact Microsoft Notepad suffers this size problem.My proposal is to trade-off this time-efficiency at the cost of handling unlimited size files. To do that, I'll keep the current cursor position in a variable. As you type, the cursor moves and the variable value increases. Moreover to support other functionalities like, replace, insert, delete, append (similar to insert) and undo, I would like to have a data structure say, action. An 'action' might have three attributes - positionForAction, stringValue and actionType. So for invoking each method like replace, insert, delete etc you pass an action instance as method argument. For undo, we need to store previous state for each action. One way to deal this is to store the undo action in a stack for each action. For example, if you delete char 'P' at location 1243, then create an action instance (positionForAction=1234, string='P', actionTpye=insert)  and store it in a stack. Search is another must-have feature and for that I would implement a good string pattern search algorithm such as Knuth-Morris-Pratt Algorithm."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I'd use gap buffer."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-1","title":"What about linked list where each node in the list stores each line of the notepad. When user inserts a new line in the middle or moves one line to some other place..we just have to change the \"next\" pointers"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-1","title":"i think a 2 dimensional array would be the best. In notepad we can move mouse from one position to any other position. We can map the new position to the array index using some mathematical calculation. This wont be possible in linked list...."}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=5698327039442944","download_status":"DOWNLOAD_DONE","votes":"-2","answersCount":"12","title":"How to design an elevator system. Main thing to worry about is how would you notify the elevator that it needs to move up or down. and also if you are going to have a centralized class to control this behavior and how could you distribute the control.","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Elevator \n        private int weightApplied \n        private int passengerNumber; \n        private String elevatorID; \n        private int floorNumber \n        private int capacity \n        private boolean started \n        private String direction \n        private String state \n        private boolean goingUp \n        private boolean doorsOpen \n        private PriorityQueue pq//PQ that gives priority to different floors based on floorNumber, non-preemptive priority scheduling \n \n        void go_up(int floorNumber); \n        void go_down(int floorNumber); \n        boolean isStarted(boolean start); \n        boolean setStarted(boolean start); \n        void load_passengers(); \n        void unload_passengers(); \n        etc... \n        getters and setters for all instance variables... \n    Passenger extends Elevator \n        private int destinationFloor; \n \n        int current_destination(int destinationFloor)"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"*repose with format corrected* \n \npublic class Elevator { \n  \n public static final int MAX_FLOORS = 50; \n  \n // upward floor queue \n private PriorityQueue floors_up = new PriorityQueue(MAX_FLOORS); \n  \n // downward floor queue \n private PriorityQueue floors_down = new PriorityQueue(MAX_FLOORS, new Comparator(){ \n  public int compare(Integer arg0, Integer arg1) { \n   return arg1.compareTo(arg0); \n  } \n }); \n  \n // effective floor queue \n private PriorityQueue floors = floors_up; \n  \n // current floor \n private int current = 0; \n \n public void userCallAt(int where) { \n  setTarget(where); \n } \n  \n public void setTarget(int target) { \n   \n  // ignore if target is current \n  if (target == current) { \n   return; \n  } \n   \n  // add target to right queue \n  if (floors == floors_up) { \n   if (target < current) { \n    floors_down.offer(target); \n   } else { \n    floors_up.offer(target); \n   } \n  } else { \n   if (target > current) { \n    floors_up.offer(target); \n   } else { \n    floors_down.offer(target); \n   } \n  } \n   \n  // swap queue to turn around the elevator \n  if (floors.isEmpty()) { \n   floors = (floors == floors_up ? floors_down : floors_up); \n  } \n } \n  \n public int getTarget() { \n   \n  if (!floors.isEmpty()) { \n   return floors.peek(); \n  } \n   \n  if (floors_up.isEmpty() && floors_down.isEmpty()) { \n   return current; \n  } \n   \n  floors = (floors == floors_up ? floors_down : floors_up); \n  return floors.peek(); \n } \n  \n public int getCurrent() { \n  return current; \n } \n  \n public void step(int target) { \n  if (target > current) { \n   current++; \n  } else { \n   current--; \n  } \n } \n  \n public void stop() { \n  floors.poll(); \n } \n  \n public void move() { \n   \n  while (getCurrent() != getTarget()) { \n   do { \n    step(getTarget()); \n   } while (getCurrent() != getTarget()); \n   stop(); \n  } \n   \n } \n  \n}"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I think we dont need so much variables and methods ... as per my approach  we need   enum Motion {  Going_Up, Going_Down, Stoped }  Class Lift {  int current Floor;  int priorityQueue nextFloorToStop;  int LiftId; }  Class LiftController {  array of lifts;  queue Allrequests;   public void CallLift(int floorIndex)  {   }   public void int NearestLift(int floorIndex)  {   }   public void bool IsMovingInSameDirection(int liftId, int FloorIndex)  {   } }  If No lift is available to take request then add that request in AllRequest queue else add it in lift's queue. When when lift comes to stop (after completing its all floor stops) then it will notify controller class to  check if there is any request pending in \"allRequest Queue\"."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"public class Elevator {    public static final int MAX_FLOORS = 50;    // upward floor queue  private PriorityQueue floors_up = new PriorityQueue(MAX_FLOORS);    // downward floor queue  private PriorityQueue floors_down = new PriorityQueue(MAX_FLOORS, new Comparator(){   public int compare(Integer arg0, Integer arg1) {    return arg1.compareTo(arg0);   }  });    // effective floor queue  private PriorityQueue floors = floors_up;    // current floor  private int current = 0;   public void userCallAt(int where) {   setTarget(where);  }    public void setTarget(int target) {      // ignore if target is current   if (target == current) {    return;   }      // add target to right queue   if (floors == floors_up) {    if (target < current) {     floors_down.offer(target);    } else {     floors_up.offer(target);    }   } else {    if (target > current) {     floors_up.offer(target);    } else {     floors_down.offer(target);    }   }      // swap queue to turn around the elevator   if (floors.isEmpty()) {    floors = (floors == floors_up ? floors_down : floors_up);   }  }    public int getTarget() {      if (!floors.isEmpty()) {    return floors.peek();   }      if (floors_up.isEmpty() && floors_down.isEmpty()) {    return current;   }      floors = (floors == floors_up ? floors_down : floors_up);   return floors.peek();  }    public int getCurrent() {   return current;  }    public void step(int target) {   if (target > current) {    current++;   } else {    current--;   }  }    public void stop() {   floors.poll();  }    public void move() {      while (getCurrent() != getTarget()) {    do {     step(getTarget());    } while (getCurrent() != getTarget());    stop();   }     }   }  *code for demo idea*"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=15423911","download_status":"DOWNLOAD_DONE","votes":"-1","answersCount":"12","title":"what's encapsulation","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"4","title":"- information hiding - expose interface - achieved by creating classes - The inclusion within a program object of all the resources need for the object to function"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"3","title":"Tell Me HOW COME ?? I mean.. How can you become so damn Lucky ?? Nobody gets such question @ Amazon...  you must be Luckiest ........... Gosh........"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"encapsulation is one of the four fundamentals of OOP (object-oriented programming). Encapsulation is to hide the variables or something inside a class, preventing unauthorized parties to use. So the public methods like getter and setter access it and the other classes call these methods for accessing"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Basically, as what its name implies, encapsulation means  1) grouping related data and subroutines together. 2) hiding irrelevant information from users. 3) exposing nessary interfaces to users.  For example, class is one of constructs that 1) group related data and subroutines into objects. 2-3) hide implementations and expose interfaces by access control(visibility of its members and of its base-class members).  Besides, in the old day, module is the construct that provides encapsulation for non-OOP languages. Like in C, a compilation unit is the body of a module that 1) groups data and subroutines. It 2-3) hides implementation details in the body and exports interfaces via its header."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Encapsulation is one of the rull of OOPS, which wrap the functionality of structure or we can say structures."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Software Developer Engineering Intern question"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Two parties involved: Class designer and Client code. Users ( client ) of the class ( designed by class designer) is unaware of the complexity of the task undertaken by the class. Encapsulation defines clean dispersal of responsibilites, with each party unaware of how other party handles the given task, with all parties interdependent in accomplishing a common goal."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-1","title":"cant belv .... amazon asks this type of ques ;)"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=1603","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"12","title":"Here is a graph of distribution centers and the weight to go from one to another.  How would you represent this using a data structure? Code an alogrithm that allows me to check if there is a path from one node to another and what the weight of this path is.","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Do a depth-first search starting at node A and ending at node B."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Can we do depth first search on graphs?"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Associate or create a class for storing Distributor Center infoLets call it DistCenterClass called Edges {DistCenter1DistCenter2Weight}Hashtable indexed by the DistCenterTo store the graphCreate distCenter objects for each distribution center For each DstCenter object ACreate a HashTable to store Edge objects If there is an edge from this DistCenter to some other DistCenter BCreate the Edge objectinitialize it with weight and the DistCenterObject references/pointersAdd the edge object to the Hashtable or map using DistCenter B as the KeyWhen done with all edges Add the DistCenter,Edge Hashtable pair to the HashTable/ HashMapHow to calculate if there is a path or notBelow function will return the list of edges that contains the path information and weight and can be used to print the path with weightsIt will return null if there is no pathList of Edges FindPath(DistCenter A ,DistCenter B){Get List of Edges from HashTable for DistCenter Aif (List empty ) return nullelse  return findCenter(List Of edges from DistCenter A, DistCenter B)         }List of Edge findDistCenter(Hashtable of Edges, DistCenter B){edge  = HashTable of edges . get (DistCenter B) if (edge != null )  return new edgeList .Add (edge)else  for iterate for each edge in hashtable    do      HashTable edges= HashTable of distCenter .get (edge.DistCenter B)      edgeList = findDistCenter(edgeList,DistCenter B)      if (edgeList != null )         return edgeList.Add(iterator.edge)    donereturn null}"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"using bfs we always get the shortest path..."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Floyyd-Warshall Algorithm finds all-pair shortest path. u have to maintain just 2 matrix of size  # of vertices X # of vertices."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Cant we not make a matrix type array where all the distribution centers become the column and row names and the weight becomes the value inside the matrix. and if there is no path then it can somehow be represented by some special value like maybe a negative number"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Use Adjacency List to represent the graph and run DFS or BFS to find out if there is a path between two nodes."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"i posted in wrong question."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"disjoint set"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Graph representation and DFS"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=5112274943475712","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"11","title":"Design a function to gives real time statistics of your web traffic,count one day's website visit ??count one week's website visit","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"6","title":"If we need to maintain statistics for only a week than \"Circular buffer\" will be the right candidate.  It will contain 7 buckets (day, count). As we will reach at 7th day (completed cycle), it will override first day.  And we will maintain a single global counter for \"week\". Each time we will move from Sunday to Monday and will overiride Monday than we will remove its count value from the week counter."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"We may want to use Synchronized keyword for each of the update functions, as multiple threads in the web app can call that function and their updates should be mutually exclusive."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"If we need to maintain statistics for only a week than \"Circular buffer\" will be the right candidate.  It will contain 7 buckets (day, count). As we will reach at 7th day (completed cycle), it will override first day.  And we will maintain a single global counter for \"week\". Each time we will move from Sunday to Monday and will overiride Monday than we will remove its count value from the week counter."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"how it is O(1), we have go thru the entire list to find for a particular day is it not O(n)"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Firstly?? I thought it's easy one. but when I run two threads and simulate 0.5 billion visits, I always got some problems. After several hours debugging and changing, finally I made code work.  OK, let's stop talk and show my c# code."}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=17002667","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"11","title":"Class and Data Structure Design for a \"metric\" system to determine the top song of a band.  Two Web Service calls:  void play(String bandname, String songname); String topSong(String bandname);   CONSTRAINTS: For this exercise we should constrain the design to a single server and do NOT use a database, but in memory data structure.  SAMPLE INPUT/OUTPUT  play(\"Guns N Roses\", \"Welcome To the Jungle\"); topSong(\"Guns N Roses\") => \"Welcome To the Jungle\" play(\"Guns N Roses\", \"Sweet Child of Mine\"); topSong(\"Guns N Roses\") => \"Welcome To the Jungle\" play(\"Guns N Roses\", \"Sweet Child of Mine\"); topSong(\"Guns N Roses\") => \"Sweet Child of Mine\"  scale the architecture","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"4","title":"we can create a max heap of songs where in the heap is arranged as per the count of the song.  Or if we need only the song which is played max times then we can have a hash of songs where song can be the key and contains count as value. we also have a max variable which contains the max count of a song at that time. When we encounter a song we increase the count of the song by one and update the max if the count is more than max"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Class Player \n{ \n    public: \n        void play(string bandName, string songName); \n        string topSong(string bandName); \n         \n    private: \n        Hash bands = new Hash(); \n} \n \nClass Band \n{ \n    public: \n        string Name; \n        void play(string songName); \n        string topSong(); \n         \n     private: \n        Hash songs = new ();       \n        // Will ensure that the topSong variable is updated by one thread at a time \n        volatile song topSong; \n} \n \nClass Song \n{ \n    public: \n        Song song; \n        void IncrementRequest(); \n        int GetNumberofRequests(); \n         \n        private: \n        int numberOfRequests;    // initialized to 0 in the constructor \n} \n \nstring topSong() \n{ \n    return this.topSong; \n} \n \nvoid play(string SongName) \n{ \n    // Assuming that in case of same number of plays, the latest song wins \n    if (topSpong.GetNumberOfRequests <= (song.GetNumberOfRequests + 1)) \n     { \n        topSong = song; \n     } \n         \n     song.incrementRequest();    \n     \n    song.play(); \n} \n \nvoid IncrementRequest() \n{ \n    this.numberOfRequests++; \n} \n \nint GetNumberOfRequests() \n{ \n    return numberOfRequests; \n}"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Here is a possible solution:  For the data structures part: you could use an 'IndexedPriorityQueue' (Hash map along with a heap for each song in the album). Maintain a Trie (or one trie for each.. say, a server). The trie would have the album as the key and our IndexedPriorityQueue as value.  For maintaining the count, before increasing a count check if the count reaches the max of Double capacity. You may need to do some normalization of values. However, you might need to take care that the amortized worst case complexity would be still  be O(number of songs in the album).  Since the number of songs is assumed to be small(<100) for each album. The reheapification process for heap won't affect the amortized run time complexity over the time.  Any constructive suggestions would be helpful. :-)  The class structure can be something like this,"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I'd use a Hashtable with BandName as the key, and a sorted linkedlist of struct as the value. Every times a song is played, the linkedlist gets updated by removing the old Song and inserting a new song with song.times incremented."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Hashtable within a Hashtable should do the job. The outer Hashtable has the albums and the inner Hashtable has the songs.  The the outer Hashtable can also have a String and count for the top song and max play count along with the song map. This is depicted below using class albumDetails. These 2 fields keep getting updated each time a request to play comes in."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I suggest a different approach - please tell me what I'm missing from the question.  Store is where the web services are directed at, it holds a hash table of the bands. Getting a band takes an O(1) containing it takes O(#bands) space"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-1","title":"void play(String bandname, String songname);  - Use HashMap with key = \"bandname + songname\" & value = \"music file path\"  String topSong(String bandname); - Use HashMap with key = \"bandname\" & value = \"top song name\""}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=1874672","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"11","title":"What is the use of overriding in OOP","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Overriding : Functions with the same definition have different behavior in different scopes. Used by a child class to change behavior it inherited from its parent.  Overloading : More than one definition for a function in the same scope that work on different inputs. Used to have one function that can operate on different data types, especially for operators. For example overloading add() would allow two integers to be added or two strings to be added."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Let me explain this way: Your dad has a bike and ur his son want to use his bike but it is outdated and u want to modify it the way you want to and ride it...that is, ur dad(class) has a function called Bike and ur using the same Bike(function) but modified/changed and ur using it(overriding). Same bike but now it is changed.... and when we say son it is ur modified bike that shud come into picture ..which has overriden ur dad's old bike"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"to get dynamic polymorphism....."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"overriding and overloading are concepts of OOPs and not language specific.  So overriding is dynamic polymorphism overloading is static polymorphism.  A Language can implements these concepts as it wants to."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Oops sorry for spam"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Overriding is useful when you want to change the functionality of some method based on a class. For example, by overriding the toString() method of Object class, we can use it with different classes.  Overloading is useful to add flexibility to a method. In general, if you want to create a method that adds two numbers then it only take either integer, double, or float but by overloading, you can add values of all data types."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"overriding: same method name and same type signature  overloading: same method name but different type signature"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-1","title":"it depends on language you are using, overriding in Java is polymorphism (as non-static member functions are virtual by default), overriding in C++ is not, if you don't explicitly using \"virtual\" keyword. In C++ overriding without virtual will not give you dynamic dispatching, e.g. call of fucntion depending on \"real\" run-time type of pointer/reference you are calling, but instead will call function depending on static/declared type.  So you must ask first - what do you mean - virtual function overriding or just overloading."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-1","title":"A \n          /  \\ \n         B   C"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-1","title":"A       \n         / \\ \n        B   C \n           /  \\ \n          D    E \n         / \\ \n        F   G \n       / \n      I"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-1","title":"A       \n         / \\ \n        B   C \n           /  \\ \n          D    E \n         / \\ \n        F   G \n       / \n      I"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=1808669","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"11","title":"Design Elevator system","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"2","title":"I think its a typical example of command pattern. Elevator system will have set of slots where each buttons (commands) can be executed.  This way we can extend the elevator system by adding new buttons very easily and each button can test individually."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"I have tried to build a more complete system, but it has flaws.  Here is my design:  System class: handles the elevator calling algorithm, which request to send to which elevator, etc. Elevator class: models an elevator Request class: Models a request"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Classes : Elevator, Floor  Floor -> Press Elevator Button. Elevator -> Go up, Go down, serviceUser, stopElevator.  ElevatorManager has a boolean array of floors, and by walking through the array, elevator can decide whether to go up or down."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"OMG...Floor is not an Object. You are using the Process Oriented way but not Object Oriented way to handle this question.  The answer is  you just need an elevator class. The elevator will save the floor information and current floor number. Then judge the current floor number and the number which it will go (from the user operation), and choose to go up or go down. very simple"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Elevator Floor/Location Identifier Number of steps Rotation speed Daterange InstallationDate MaintainenceDate Department Identifier AllowedWeight Detail / Description  Start Stop SetDirection SetRotationSpeed EmergencyStop = Stop + Alert EmergencyAccidentSenser Handler"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"it would be nice to add these two variables numOfStopsAhead numOfStopsBehind  according to the direction and requested floor you can increment either every stop decrements the first one if the first one becomes 0, it is time to change direction and swap these 2 variables as well. stop if both is 0 a floor request would increment the ahead one and set the direction and call start"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I was asked the same question, the main issue that you need to worry about is how would you notify the elevator that it needs to move up or down. and also if you are going to have a centralized class to control this behavior and how could you distribute the control."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"There is Video available that will demonstrate how to model elevator, youtube .com watch?v=fITuhLSwbt8"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=65908","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"11","title":"How do you model an elevator in OOP? Extremely vague question on purpose. He wanted me to talk about the algorithm of elevator selecting which floors to go to based on the buttons pushed inside and outside elevator. Kept on asking followup questions. Prepare by thinking about how the algorithm for elevator works.","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"2","title":"I think all elevators follow what is known as elevator algorithm. The elevator goes up until all ups - which include calls from up and requests to up by the people picked up are served. After the highest up is served, the elevator goes in the other direction, until the lowest down is served, and this repeats."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I was asked this at Microsoft interview"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I think a relevant answer would be by using the Disk Read/Write algorithms like F-Scan, C-Scan, etc."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Guys, this is not a algorithm question, this is a OOD question.  Don't even try to think which algorithm the elevators use. You only need to specify classes and their interactions."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"rgvsdep , buy generic viagra vcood.%$#@ , buy phentermine no prescription iygy , buy levitra online qcopp , cheap meridia 68458 , fluoxetine prozac jhg$# , buy soma online 55 , buy tramadol now"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"It is a purely algorithm check and data structure usage question.  Follow Knuth's 'The Art of Computer Programming', Page 282 onward.  Good Luck!"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Elevator : \nResponsibilities - no. of passengers aboard,destination floors,state & direction,current floor \nMethods - load/unload passengers, current floor/passengers/dir/state \nAttributes - passengers, floor, dir, state, elevator_id      \nPassenger : \nRes - keeps track of the destination floor \nMds - current_destination \nAtt - destination_floor \nObserver : \nRes - keeps track of the passengers entering & leaving the elevator \nMda - total_entry/exit_passengers,passenger_enter/exit \nAtt - total_entry/exit_passengers"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"SOA presents the big picture of what you can do with Web services. Web services specifications define the details needed to implement services and interact with them. However, SOA is an approach to build distributed systems that deliver application functionality as services to end-user applications or to build other services. SOA can be based on Web services, but it may use other technologies instead. In using SOA to design distributed applications, you can expand the use of Web services from simple client-server models to systems of arbitrary complexity.  Thus, individual software assets become the building blocks to develop other applications. You can reduce the complexity of systems by using a common style of interaction that works with both new and legacy code (Lawrence Wilkes, of CBDi, has joked that SOA could stand for ??Save Our Assets\" ). There is a standard way of representing and interacting with these software assets; now the focus shifts to application assembly based on these building blocks.  While discussing SOA for business applications here, SOA is also being used for other distributed systems such as grid computing and advanced Web services specifications (for example, WS-DistributedManagement, WS-Trust, and UDDI)."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Such Questions Suck.. make life miserable"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"programming elevator design visit"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=2983","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"11","title":"Design the classes and objects for a generic deck of cards that would be used in a poker game","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"A generic list class with Front Back Split and Shuffle Merge may be. One can also write a shuffle function as for i = 1 to n   swap(cards[i], cards[random(i,n)]);"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"operations: shuffle, deal, and play. so class: Card, Player, Dealerobjects: card objects, player objects, and a single dealer object.Any improvement?"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"it asks about generic dec of \"cards\", not players.so it would be likedeck -> suite -> cards something like that, and maybe have multi-inheri for face cards and numbered cards... perhaps."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Seems like the basic classes would be Deck and Card. I think it's a mistake to use inheritance to designate different types of card; the difference between a two of hearts and a queen of spades is nothing more than data.For a card, we'd want an int member variable for the value (not zero-based, so it syncs with actual card numbers... one -> ace, five -> five, twelve -> queeen, etc.), and an enum for the suit. It would be trivial to check whether the card was red or black; thus, it's probably not necessary to have a member for that.The deck class would need some sort of collection of fifty-two cards. Since this is for poker, it's probably safe to assume that we'll only draw from the top of the deck; thus, we can just keep a variable with the number of cards in the deck for use when we shuffle or something so we don't have to worry about the cards we removed, and store it in a simple array. We'd want some sort of \"shuffle\" method... I'm not familiar with the relative randomness of various algorithms, but what SP suggested sounds fine. We'd of course want a \"draw\" method that would return the top card of the deck and decrement the card count. The constructor should add all of the possible cards to the deck, but not shuffle, in case the user wants it sorted for some reason."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Define Struct or a Class Cards (Holds Color, Number)Define Class Deck add the cards for each type."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"What if I don't know anything about a Poker game?"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"class - card,hand,deck objects for class - suite,rank"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=13320670","download_status":"DOWNLOAD_DONE","votes":"1","answersCount":"10","title":"customers want to buy some products but products are out of stock, design a system to notify them when those products are again available?","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"3","title":"1. when a product is added to system it would generate an event.  2. Customer notification module will register and receive this event. 3. Customer wishlist table will list of customer id with product id they wish for. 4. The event processing will look for customer list for the product id, event is generated for. 5. It would notify those customers.  6. and remove them from the wishlist table."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"2","title":"import java.util.*;   public class Stock {        public static  void inStock(int productId){               int id = productId;       HashMap stock = new HashMap();               stock.put(101,5);        stock.put(102,6);        stock.put(103,7);        stock.put(104,8);        stock.put(105,9);                       int value = stock.get(id);               if(value==0){         System.out.println(\" stock of the  product is null\");         }                        else if( value>0 && value<25) {                 System.out.println(\" stock of the  product  going to finish but above 0 and less than 25\");                  }                else {                  System.out.println(\" we have a sufficient\");                      }         }      public static void main(String args[]){          inStock(102);                                            }                            }"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"it is a pure example of \"Observer\" pattern. Customer will be register for with producer for notifications. stock would be observable entiry. Observer will notify all registered customers about the stock availability."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"java-x.blogspot.kr/2007/01/implementing-observer-pattern-in-java.html"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"It is just like a producer and consumer problem, store all customers id's in an array, if products are available, corresponding single sent to customets (like consumer in thread progaming)"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Store user and product withslist information in table or data structure. When new stock comes in, do a join on the product id and get the list of customers with the corresponding product wish list and send a notification to them..   just another thought, is this simple, or there is something underthe hood for the problem"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"here we have a class Store which having list of product and its availability if any customer want any product it is there give him other wise register him for notification for particular product notification list when item is added notify all customer who is available in notification list and remove customer from that notification list.\"observer pattern\""},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"here we have a class Store which having list of product and its availability if any customer want any product it is there give him other wise register him for notification for particular product notification list when item is added notify all customer who is available in notification list and remove customer from that notification list.\"observer pattern\""},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Observer pattern."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"We can utilize 4 main classes:"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=24959662","download_status":"DOWNLOAD_DONE","votes":"-3","answersCount":"9","title":"Requirements: 1>client should be able to create shapes like circle, square , rectangle..etc,. Also framework should be able to  add some more shapes later. 2> client should be able to calculate areas of each shapes 3> should have collection where all shapes are stored and should be able to sort on the area of the shapes","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"2","title":"Create an abstract \"shape\" class with an abstract method called \"getArea\".  Create concrete classes for each specific shape that implements the \"getArea\" method (you could use the factory pattern to handle the creation of these object types).  Because all these objects extend \"shape\" you could you store them all in the same collection type.  For example, in Java, Collection shapes;"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Create on factory class which will create shape objects based ont he parameters passed by client. Create one class which will calculate area on the basis of shape object passed. Can't think of more than this."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"1)create interface Area with method getArea(double ... parameters) \n2)have concrete implemetations like rectArea, circArea etc which have getArea method implemented accordingly. \n3) Have a base class Shape implements Comparable and which has Area as a member field. \n4) Have a constructor like Shape(Area requiredArea){ this.Area = requiredArea) and a method getArea(){ return Area.getArea()) \n5) Have comparable to act on Area.getArea() of Shape class. \n6) Since all are type of Shape class, hence they can be stored in collection of type Shape."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Using Comparable interface :  public class Shape  implements Comparable{  ...  ..   @Override     public int compareTo(Shape shape) {         return this.getArea() - shape.getArea();     } }  Using Comparator :  somewhere in code :  Collections.sort(shapes, new Comparator {     @Override     public int compare(Shape s1, Shape s2) {         return s1.getArea() - s2.getArea();     } })"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"class shape { public:     double area; public:          virtual double getArea(){}      }; class circal:public shape {     double radius; public:     double getArea(){return area;}     circal(int r):radius(r){area = pi*radius*radius ;} }; class rec:public shape {     double eage; public:     double getArea(){ return eage*eage;}     rec(int e):eage(e){area = eage*eage;} }; bool cmp(shape *p1,shape *p2) {     return p1->areaarea; }  vector v;"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-5","title":"d"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=9670124","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"9","title":"expression tree design.","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"2","title":"I think what the question means if - if you are given an infix/postfix expression, make an expression tree out of it.   Eg. Convert a postfix expression into an expression tree  Algorithm:  1. Intialize a stack to store binary tree nodes.  2. Read the array from left to right.  3. If you come across an operand, make a node out of it and push into the stack.     If its an operator, pop two nodes from the stack and first popped node would be the       operator node's right child and the second popped node would be the operator node's left child. Push the operator node into the stack 4.The last popped node would be the head of the tree."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"If you are talking about how will you represent this in OO-world, then the answer is using Composition design pattern which is structural."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I didn't understand the question.. could someone provide more info..."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Expression Tree is ( math or regular).. Example: a+b  +ab can be represented in a binary tree.  Design: A simple binary tree will do for Math Expression taking the inpifx"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I think the question is not about data structure to be used for expression tree but a design for it.  I can think of a following class structure:"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=5749729090600960","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"8","title":"Design a class for Game of card. You can use any design pattern or data structure. 1. There are 52 card. 2. There are 4 suits, each contain 13 cards.","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"3","title":"#include   \n#include  \n#include  \n \nusing namespace std;  \n \nenum CardSuite \n{ \n    CARD_CLUB,  \n    CARD_HEART, \n    CARD_SPADE,  \n    CARD_DIAMOND \n}; \n \nenum CardNumber  \n{ \n    CARD_ONE = 1, \n    CARD_TWO, \n    CARD_THREE, \n    CARD_FOUR, \n    CARD_FIVE, \n    CARD_SIX, \n    CARD_SEVEN, \n    CARD_EIGHT,  \n    CARD_NINE, \n    CARD_TEN, \n    CARD_JACK, \n    CARD_QUEEN, \n    CARD_KING \n \n}; \n \nclass OneCard \n{ \n    CardSuite eSuite_; \n    CardNumber eNumber_; \n    public :  \n         \n        OneCard(CardSuite suite, CardNumber num) \n        { \n            eSuite_ = suite; \n            eNumber_=num; \n        } \n        CardSuite GetSuite() \n        { \n            return eSuite_; \n        } \n        CardNumber GetNumber()  \n        { \n            return eNumber_; \n        } \n        void Decompile() \n        { \n            cout << eSuite_ << \" \" << eNumber_ << endl; \n        } \n}; \n \nclass CardDeck \n{ \n    vector  cardDecks_;  \n    public: \n        CardDeck() \n        { \n            CardSuite suite; \n            CardNumber cNumber; \n            for (suite = CARD_CLUB; suite != CARD_DIAMOND + 1; suite = static_cast(suite + 1)) \n            { \n                for (cNumber = CARD_ONE; cNumber != CARD_KING + 1; cNumber = static_cast(cNumber + 1)) \n                { \n                    OneCard card = OneCard(suite, cNumber); \n                    cardDecks_.push_back(card); \n                } \n            } \n        } \n \n        void RandomizeCards() \n        { \n            std::random_shuffle(cardDecks_.begin(), cardDecks_.end()); \n        } \n \n        void Decompile()  \n        { \n            vector :: iterator iter = cardDecks_.begin(); \n            while (iter != cardDecks_.end()) \n            { \n                (*iter).Decompile(); \n                iter++; \n            } \n        } \n \n \n}; \n \n \nint main( ) \n{  \n    CardDeck oneCardDeck; \n    oneCardDeck.Decompile(); \n    oneCardDeck.RandomizeCards(); \n    oneCardDeck.Decompile(); \n    return 0;  \n}"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"There should be four classes:  1. CardGame      suits[4] : Suit 2. Suit     cards[13] : Card     suiteType : CardType 3. Card      cardNumber : int      type: CardType 4. CardType     type: String"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"2 dimensional arrays with 4 rows and 13 columns"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"same Q was asked in Demand Media phone interview"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"{ class Card{  String cardType;   int number; }  for CardType we can use enum.  and to create 52 cards we can have Set packOfCards  }"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"There could be a separate method living somewhere that would print out a card like \"Ace of Spades\" or whatever."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Can't we use flyweights for Cards because card number is fixed from 1 to 13.  So there will not be 52 objects of Cards. There will be only 13 Card objects and 4 Suit objects."}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=22496662","download_status":"DOWNLOAD_DONE","votes":"-1","answersCount":"8","title":"Design a DVD renting library system","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"3","title":"class DVD \n { \n    int id; \n    double price; \n    string  Name; \n    int  status;  // Availabe(or) Rented \n    string customer; // custid \n    string  StartDate; // Rent Start Date \n    string  Enddate;  // Rent End Date \n    \n  public: \n    // get,set methods \n} \n \n \nclass DVDLibrary \n{ \n   // map of dvd id and pointer to DVD object \n   map   collection1; \n \n   // multimap of name of DVD to dvd id \n   multimap   collection2; \n \n  public: \n   //methods to modify collection1 and collection2 \n} \n \nclass Customer \n{ \n   string customer; \n \n   list   dvdlist; \n    \n   list paymentlist; \n \n public: \n  //methods \n} \n \nclass Payment \n{ \n   string customer; \n \n   float  amt; \n  \n   string paymentdate; \n \n  public: \n  // methods \n}"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"I think DVD class should not contain start and end date. That needs to be maintained separately by your controller (DVD Library).   How would you find who has taken a particular DVD? This also needs to be maintained by DVD Library"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"This is the design for library where books are rented. Replace books with dvds and the design should work. thought-works.blogspot.in/2012/11/object-oriented-design-for-library-to.html"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"#include   \n#include  \n#include \nusing namespace std;  \n \n \nclass DVD \n{ \n    string sName_; \n    int iD_; \n    string sDescrption_; \n    int iRent_; \n    bool bRented_; \n    public: \n        DVD(string name, int id, int rent, string desc = \"\") : sName_(name), iD_(id),  \n            sDescrption_(desc), iRent_(rent), bRented_(false){} \n        const char* GetName() const \n        { \n            return sName_.c_str(); \n        } \n        const char* GetDescription() const \n        { \n            return sDescrption_.c_str();         \n        } \n        int GetID() const \n        { \n            return iD_; \n        } \n        int GetRent() const \n        { \n            return iRent_; \n        } \n        bool IsRented() const \n        { \n            return bRented_; \n        } \n        bool SetRentStatis(bool bRented) \n        { \n            bRented_ = bRented; \n        } \n}; \n \nclass Customer \n{ \n    string sAddress_; \n    string sCustName_; \n    bool bIsMember_;     \n    int iCustId_; \n    public: \n        Customer(int id, string name, string address,bool member=false) : sCustName_(name), \n                sAddress_(address), bIsMember_(member), iCustId_(id) \n                {} \n        const char* GetName() const \n        { \n            return sCustName_.c_str(); \n        } \n        const char* GetAddress() const \n        { \n            return sAddress_.c_str(); \n        } \n        bool IsMember() const \n        { \n            return bIsMember_; \n        } \n        bool SetMember()  \n        { \n            bIsMember_ = true; \n        } \n}; \n \nclass DVDLibrary \n{ \n    private: \n        //! Table of id vs DVD \n        map mIDTableDVD_; \n        //! name of DVD vs DVD pointers. \n        multimap mmTableOfNameDVD_; \n        //! Multimap of customer id vs DVD's with that customer. \n        multimap mmTableOfCustNameDVD_; \n        //! ID vs customer table. \n        multimap mIDCustomerTable_; \n    public: \n        DVDLibrary(){} \n \n        //! Add DVD to the store.   \n        //! Create a DVD pointer and  \n        //! Update mIDTableDVD_, mmTableOfNameDVD_ \n        bool AddDvd(); //! Add dvd details as params \n        //! Remove DVD from the store. \n        //! Clear entry from mIDTableDVD_,mmTableOfNameDVD_ \n        bool RemoveDvd(); \n        //! Ask the Customer Id. \n        //! Check if the max number of the DVD's reached, If not give DVD  \n        //! and do not prepare report. \n        //! set DVD status to rented.  \n        bool RentDvdToMember(); \n        //! Customer has agreed to buy the DVD. \n        //! Get Customer details. Create new customer. Add it to mIDCustomerTable_ \n        //! Get Payment for each DVD \n        //! set DVD status to rented. \n        bool RentDvdToCustomer(); \n        //! Let customer return DVD. \n        //! Update mmTableOfCustNameDVD_ and set the DVD status to not Rented. \n        bool RetrunDvdByCustomerOrMember(int dvdId, int custID); \n        //! Prepare the payment receipt for Customer. \n        //! To be called by RentDvdToCustomer. \n        string PrepareReceipt(int dvdId, Customer* cust); \n \n};"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=11208881","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"8","title":"Design a parking lot where cars and motorcycles can be parked.","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"3","title":"1. Create a class for the vehicle:"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"enum CarType{ car, mobile}; Class Vehicle{     CarType _type;     string owner;     int RestTime;  } class ParkingLot{     int CarPosition;     int MotorPosition;"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"enum CarType{ car, mobile}; Class Vehicle{     CarType _type;     string owner;     int RestTime;  } class ParkingLot{     int CarPosition;     int MotorPosition;"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"class Vehicle{} class Car: public Vehicle {} class Motor: public Vehicle{} class Slot {     Vehicle* pVehicle; }"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"class Vehicle{} class Car: public Vehicle {} class Motor: public Vehicle{} class Slot {     Vehicle* pVehicle; }"},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Some questions needs to be asked --- Are both expected to consume the same amount of space? (It may be desirable that a different parking lot or a different level or a selected area be designated for Motorcycle parking).  Other important point that needs consideration are duration of parking and payment, Type of parking spot (Regular, Valet or for Handicapped - More classes can be added)."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"-3","title":"union Vehicle {   Car;   MotorCycle; } Hash ParkingLot;  :P"}]}},{"question":{"mm_name":"interview_question","location":"http://www.careercup.com/question?id=8870188","download_status":"DOWNLOAD_DONE","votes":"0","answersCount":"8","title":"(3rd phone interview)Design Clothing store using OOP concepts. based on your design tell how you'll find if the store has XXL size of a particular shirt.","interview_question_comments":[{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"I suggest using a Factory Method pattern to make the design more flexible and extendible. You can have an abstract class Clothes, which has properties such as price, brand, size, etc. and different kinds of clothes subclass it, overloading price() and brand(). This has the benefit that the store could sell objects of type Clothes, and through runtime polymorphism resolve what kind of clothes to sell. A hash table or a map in the Store class could help finding what sizes of clothes are in-stock.  To take this further, we might also consider Abstract Factory pattern to be able to sell families of clothes such as shirts, underwear, dresses, jackets, etc. and to account for more flexibility with respect to later additions of clothes to the store and modifications."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"1","title":"Probably Command or Composite Pattern."},{"mm_name":"interview_question_comments","download_status":"UNPROCESSED","votes":"0","title":"Class Store {  String location  int phone  int branch_id  String email     ArrayList cloth;    add(cloth)  {   //add barcode and price to Hash  }         // for purchase and return  Hash   //methods that returs arraylist of clothes  ArrayList getCloth(cloth.type)  ArrayList getCloth(cloth.size)  ArrayList getCloth(cloth.brand) }  Class Cloth {   String brand  enum size {S, M, L, XL, XXL}  enum type {TShirt, Shirt, Pant, Jeans,..}  float price  long barCode   Cloth()  Cloth(type) }  Class Customer {   buyCloth(Cloth.barCode, PaymentObj)   {     //get price     //returns Payment receipt number       }         returnCloth(Cloth.barCode) {} }  Class Staff{}  Class Payment {   int receiptN }  Let me know if this design is good!"}]}}]